patterns:

    $techSupport = (техподдержк*/техподержк*/техотдел*/техслужб*/тех* (поддержк*/подержк*/поддердк*/служб*/~отдел/саппорт*/сапорт*/суппорт*/супорт*/@Operator/человеу/customer service/~эксперт/~менеджер))
    
    $tvChannelProblem = ( * {не идут * @TVChannelPlural } *
        | * { (@TVSet/@Television) * (не идет/не идут/не идти) * }
        | * { (@TVSet/@Television) * восстанов* } *
        | * { (@TVSet/@Television) * не запуска* * }
        | * { (выключен*/отключен*) * @Television * } *
        | * { (выключен*/отключен*) * @TVChannelPlural * } *
        | * { (надпис*/написан*/пишет) * на * @TVSet * ошибк* } *
        | * { (не @Successful) * подключ* * @Television } *
        | * { (что/что то/что-то) * случил* * @Television } *
        | * { (что/что то/что-то) * случил* * @TVChannelPlural } *
        | * { @Television * (не играет) } *
        | * { @Television * (не появил*/не появля*/не появит*) } *
        | * { @TVChannelName * [@TVChannelName] * пропали } *
        | * { @TVChannelPlural * (не играют) } *
        | * { @TVChannelPlural * (не появил*/не появля*/не появит*) } *
        | * { @TVChannelPlural * убрали } *
        | * { *кодирован* * @Television } *
        | * { *рвал* * @Television } *
        | * { исчез* * @TVChannelPlural } *
        | * { исчезло * @Television } *
        | * { когда * @Television * *работа* } *
        | * { когда * @TVChannelPlural * *работа* } *
        | * { когда * видео * включа* } *
        | * { когда * картинк* * включа* } *
        | * { $When * (починят/почините/сделают/сделаете/включат/включите/подключат/подключите/заиграет/заиграют) * (@TVChannelPlural/@Television/сигнал)} * 
        | * { найти * @TVChannelPlural } *
        | * { не *работ* * @Television  } *
        | * { не *работ* * @TVChannelPlural } *
        | * { не включ* * @Television } *
        | * { не включ* * @TVChannelPlural } *
        | * { не найден* * @TVChannelPlural } *
        | * { не найти * @TVChannelPlural } *
        | * { не наход* * @TVChannelPlural } *
        | * { не нашел* * @TVChannelPlural } *
        | * { не нашл* * @TVChannelPlural } *
        | * { не отображ* * @Television  } *
        | * { не отображ* * @TVChannelPlural } *
        | * { не показыв* * @TVSet } *
        | * { не показыв* * @Television } *
        | * { [всё равно] * не показыв* * @TVChannelPlural } *
        | * { нет* * (изображени*/картинк*/антенн*/сигнал*) * @Television } *
        | * { нет* * (изображени*/картинк*/видео/антенн*/сигнал*) * @TVSet } *
        | * { сегодня * нет* * (изображени*/картинк*/видео/антенн*) } *
        | * { нет* * никак* * (изображени*/картинк*/видео/антенн*) } *
        | * { нет* * видео * (@TVSet/@Television) } *
        | * { нет* * подключени* * @Television } *
        | * { обруб* * (@TVSet/@Television) } *
        | * { отключил* показ* * @Television } *
        | * { отключил* показ* * @TVChannelPlural } *
        | * { отруб* * (@TVSet/@Television) } *
        | * { переста* * показ* * @Television } *
        | * { переста* * показ* * @TVChannelPlural } *
        | * { переста* * работ* * @Television } *
        | * { переста* * работ* * @TVChannelPlural } *
        | * { перестал* * показыва* * @Television  } *
        | * { [почему] * отключил* * (@TVSet/@Television/@TVChannelPlural) } *
        | * { профилактик* * @TVChannelPlural * @TVSet } *
        | * { сдела* (работ*/рабоч*/работающ*) * @Television } *
        | * { сдела* (работ*/рабоч*/работающ*) * @TVSet } *
        | * { убира* * @TVChannelPlural } *
        | * { убрал* * @TVChannelPlural } *
        | * {(нету/нет) * @Television } *
        | * {(сбой/сбои) * обычн* * @TVChannelPlural } *
        | * {(сбой/сбои) * стандартн* * @TVChannelPlural } *
        | * {(сбой/сбои) * федеральн* * @TVChannelPlural } *
        | * {(сбой/сбои) * центральн* * @TVChannelPlural } *
        | * {[код] ~ошибка * @TVErrorCodes } *
        | * { ошиб* * @TVChannelPlural } *
        | * { ошиб* * @TVSet } *
        | * { ошиб* * @Television } *
        | * {[куда/куда то/куда-то] * (делись/делось/делась) * @Television } *
        | * {[куда/куда то/куда-то] * делись * @TVChannelPlural } *
        | * {{@Internet * есть} * {@Television * не работ*}} *
        | * {{@Internet * есть} * {@TVSet * не работ*}} *
        | * {{@Internet * работ*} * {@Television * не работ*}} *
        | * {{@Internet * работ*} * {@TVSet * не работ*}} *
        | * {@Television * (пропад*/пропало/пропаж*)} *
        | * {@TVChannelPlural * (пропад*/пропали/пропаж*)} *
        | * {не идет * (ни один/ни одна/ни одно) * @TVChannelSingular } *
        | * {не идут * (все/вся) * @TVChannelPlural } *
        | * {не идут * (ни как*/никак) * @TVChannel } *
        | * {не показ* * (все/вся/всё) * @TVChannelPlural } *
        | * {не показ* * (ни как*/никак) * @TVChannel } *
        | * {не показ* * (ни один/ни одна/ни одно) * @TVChannelSingular } *
        | * {не работ* * (все/вся) * @TVChannelPlural } *
        | * {не работ* * (ни как*/никак) * @TVChannel } *
        | * {не работ* * (ни один/ни одна/ни одно) * @TVChannelSingular } *
        | * {не работ* * @TVSet } *
        | * {не подключ* * (все/вся) * @TVChannelPlural } *
        | * {не подключ* * (ни как*/никак) * @TVChannel } *
        | * {не подключ* * (ни один/ни одна/ни одно) * @TVChannelSingular } *
        | * {не подключ* * @TVChannelPlural } *
        | * {не подключ* * @TVSet } *
        | * {нет сигнала * @Television } *
        | * {нет сигнала * @TVChannelPlural } *
        | * {нет сигнала * @TVSet } *
        | * {нет сигнала * @TVSet * @Operator} *
        | * {нет сигнала * провер* * @Cable } *
        | * {нет сигнала * неисправ* * @Cable * @Decoder} *
        | * {остал* * [только] * обычн* * @TVChannelPlural } *
        | * {остал* * [только] * стандартн* * @TVChannelPlural } *
        | * {остал* * [только] * федеральн* * @TVChannelPlural } *
        | * {остал* * [только] * центральн* * @TVChannelPlural } *
        | * {отсутств* * @Television } *
        | * {отсутств* * обычн* * @TVChannelPlural } *
        | * {отсутств* * стандартн* * @TVChannelPlural } *
        | * {отсутств* * федеральн* * @TVChannelPlural } *
        | * {отсутств* * центральн* * @TVChannelPlural } *
        | * {показыва* * [только] * обычн* * @TVChannelPlural } *
        | * {показыва* * [только] * стандартн* * @TVChannelPlural } *
        | * {показыва* * [только] * федеральн* * @TVChannelPlural } *
        | * {показыва* * [только] * центральн* * @TVChannelPlural } *
        | * {работа* * [только] * обычн* * @TVChannelPlural } *
        | * {работа* * [только] * стандартн* * @TVChannelPlural } *
        | * {работа* * [только] * федеральн* * @TVChannelPlural } *
        | * {работа* * [только] * центральн* * @TVChannelPlural } *
        | * {не идет * (первый/1) @TVChannelSingular } *
        | * {не работ* * (первый/1) @TVChannelSingular } *
        | * {не показ* * (первый/1) @TVChannelSingular } *
        | * {отсутств* * (первый/1) @TVChannelSingular } *
        | * {не идет * (второй/2) @TVChannelSingular } *
        | * {не работ* * (второй/2) @TVChannelSingular } *
        | * {не показ* * (второй/2) @TVChannelSingular } *
        | * {отсутств* * (второй/2) @TVChannelSingular } *   )

    $setupTVChannels = (* { пакет* каналов * @TVChannelPackageName } * как * [теперь] * активировать *
        | * как * [теперь] * активировать * { пакет* каналов * @TVChannelPackageName } *
        | * { исчез* * каналы * @TVChannelName * [@TVChannelName]} *
        | * куда * (переноси*/перенес*/убира*/убрал*/делся/делись/дели/подевал*) * @TVChannel * @TVChannelName *
        | * на месте * @TVChannelName * показыва* * (что то/что-то) * другое *
        | * { (сбил*/сбива*/*регулировать/*регулируй*/активировать/активируй*) * @TVChannelPlural} *
        | * { (настройк*/*настроить/*настраивать/настрой*/настраивай*) * @Television } *
        | * (непонятн*/нерусск*/китайск*/чужой/чужие/иностранн*/зарубежн*/другой/другие/новый/новые) * язык* * [на/у/по] * @Television *
        | * (переносит*/переносил*/пернест*/перенесл*) * (мест*/кнопк*) @TVChannel @TVChannelName *
        | * (найти/находить) * (мест*/кнопк*) * @TVChannel @TVChannelName *
        | * (обнаружить/обнаруживать) * (мест*/кнопк*) * @TVChannel @TVChannelName *
        | * (замен*/*менять) * @TVChannel @TVChannelName *
        | * (непонятн*/нерусск*/китайск*/чужое/чужие/иностранн*/зарубежн*/другое/другие/новое/новые) * (имя/имена) * @TVChannel *
        | * (перемеш*/перепут*/перемест*/перенес*/удал*) * @TVChannel @TVChannelName *
        | * { обнови* @TVChannel @TVChannelName } *
        | * (~настройка/*настроить/*настраивать) * трансляци* * @TVChannel *
        | * откуда * (взять/взял*) * @TVChannel *
        | * { (не @Successful) * *настроить * @TVChannel } *
        | * { (не @Successful) * настройк* * @TVChannel } *
        | * { (не @Successful) * *настраивать * @TVChannel } *
        | * { (не @Successful) * настро* * @TVChannel } *
        | * { (не @Successful) * настраивай* * @TVChannel } *
        | * { помощ* * настройк* * @TVChannel } * 
        | * { помог* * настройк* * @TVChannel } * 
        | * { помощ* * *настроить * @TVChannel } * 
        | * { помог* * *настроить * @TVChannel } * 
        | * { помощ* * *настраивать * @TVChannel } * 
        | * { помог* * *настраивать * @TVChannel } * 
        | * { помощ* * настраивай* * @TVChannel } * 
        | * { помог* * настраивай* * @TVChannel } * )

    $noLink = ( * {нет * @Internet} *
        | * { (нет/нету) * подключени* * @Internet } *
        | * { (нет/нету) * связ* * @Internet } *
        | * { (нет/нету) * сет* * @Internet } *
        | * { (нет/нету) * соединени* * @Internet } *
        | * { (нет/нету) трафик*} *
        | * { не дает* * соединени* } *
        | * { не дает* * трафик* } *
        | * { не дает* * cвяз* } *
        | * { не подключает* * @Internet } *
        | * { не подключает* * связ* } *
        | * { не подключает* * сесси* } *
        | * { не подключает* * соединени* } *
        | * { не подключает* * трафик* } *
        | * { не предоставляет* * связ* } *
        | * { не предоставляет* * соединени* } *
        | * { не предоставляет* * трафик* } *
        | * { не работа* * @WiFi } *
        | * { не *работа* * @Internet * @Telephone } *
        | * { не *работа* * @Internet * @Television * @Telephone } *
        | * { не *работа* * @Internet * @TVSet * @Telephone } *
        | * { не *работа* * @Television * @Internet } *
        | * { не *работа* * @TVSet * @Internet } *
        | * { не *работа* * @Television * @WiFi } *
        | * { не *работа* * @TVSet *  @WiFi } *
        | * { починит* * работ* * @Internet } *
        | * { починят * работ* * @Internet } *
        | * { чинит* * работ* * @Internet } *
        | * { актив* * @Internet } *
        | * { неактив* * @Internet } *
        | * { ниактив* * @Internet } *
        | * { ни актив* * @Internet } *
        | * { нет актив* * @Internet } *
        | * { не * актив* * @Internet } *
        | * {*ладят * работ* * @Internet} *
        | * {*ладят * работ* * @WiFi} *
        | * {актив* * @WiFi} *
        | * {актив* * подключени* * @WiFi} *
        | * {актив* * работ* * @WiFi} *
        | * {актив* * связ* * @WiFi} *
        | * {актив* * соединени* * @WiFi} *
        | * {включит* * работ* * @Internet} *
        | * {включит* * работ* * @WiFi} *
        | * {возобнов* * работ* * @Internet} *
        | * {возобнов* * работ* * @WiFi} *
        | * {заблокирова* * @Internet } *
        | * {заблокирова* * @Internet} *
        | * {заблокирова* * подключени* * @Internet} *
        | * {заблокирова* * подключени* * @WiFi} *
        | * {заблокирова* * связ* * @Internet} *
        | * {заблокирова* * связ* * @WiFi} *
        | * {заблокирова* * соединени* * @Internet} *
        | * {заблокирова* * соединени* * @WiFi} *
        | * {заглох* * @Internet} *
        | * {заглох* * подключени* * @Internet} *
        | * {заглох* * подключени* * @WiFi} *
        | * {заглох* * связ* * @Internet} *
        | * {заглох* * связ* * @WiFi} *
        | * {заглох* * соединени* * @Internet} *
        | * {заглох* * соединени* * @WiFi} *
        | * {заглуши* * @Internet } *
        | * {заглуши* * подключени* * @Internet} *
        | * {заглуши* * подключени* * @WiFi} *
        | * {заглуши* * связ* * @Internet} *
        | * {заглуши* * связ* * @WiFi} *
        | * {заглуши* * соединени* * @Internet} *
        | * {заглуши* * соединени* * @WiFi} *
        | * {когда * *ладят * @Internet} *
        | * {когда * будет * @Internet} *
        | * {когда * включит* * @Internet} *
        | * {когда * возобновит* * @Internet} *
        | * {когда * возобновлять * @Internet} *
        | * {когда * заработа* * @Internet} *
        | * {когда * работа* * @Internet} *
        | * {когда * починит* * @Internet} *
        | * {когда * починят * @Internet} *
        | * {когда * сдела* * @Internet} *
        | * {через сколько * *ладят * @Internet} *
        | * {через сколько * будет * @Internet} *
        | * {через сколько * включит* * @Internet} *
        | * {через сколько * возобновит* * @Internet} *
        | * {через сколько * возобновлять * @Internet} *
        | * {через сколько * заработа* * @Internet} *
        | * {через сколько * работа* * @Internet} *
        | * {через сколько * починит* * @Internet} *
        | * {через сколько * починят * @Internet} *
        | * {через сколько * сдела* * @Internet} *
        | * {когда * *ладят * @WiFi} *
        | * {когда * будет * @WiFi} *
        | * {когда * включит* * @WiFi} *
        | * {когда * возобновит* * @WiFi} *
        | * {когда * возобновлять * @WiFi} *
        | * {когда * заработа* * [@WiFi]} *
        | * {когда * работа* * @WiFi} *
        | * {когда * починит* * @WiFi} *
        | * {когда * починят * @WiFi} *
        | * {когда * сдела* * @WiFi} *
        | * {через сколько * *ладят * @WiFi} *
        | * {через сколько * будет * @WiFi} *
        | * {через сколько * включит* * @WiFi} *
        | * {через сколько * возобновит* * @WiFi} *
        | * {через сколько * возобновлять * @WiFi} *
        | * {через сколько * заработа* * [@WiFi]} *
        | * {через сколько * работа* * @WiFi} *
        | * {через сколько * починит* * @WiFi} *
        | * {через сколько * починят * @WiFi} *
        | * {через сколько * сдела* * @WiFi} *
        | * {код * @InternetErrorCodes} *
        | * {(не @Successful) * установить * @Internet} *
        | * {(не @Successful) * установить * подключени*} *
        | * {(не @Successful) * установить * соединени*} *
        | * {(не @Successful) * установить * @WiFi} *
        | * {(не @Successful) * подключить * @Internet} *
        | * {(не @Successful) * подключить * подключени*} *
        | * {(не @Successful) * подключить * соединени*} *
        | * {(не @Successful) * подключить * @WiFi} *
        | * {не включает* * @Internet} *
        | * {не включает* * @WiFi} *
        | * {не включает* * связ*} *
        | * {не включает* * сесси*} *
        | * {не включает* * соединени*} *
        | * {не включает* * трафик*} *
        | * {не заработ* * @Internet} *
        | * {не подключает* * @Internet} *
        | * {не подключает* * связ*} *
        | * {не подключает* * сесси*} *
        | * {не подключает* * соединени*} *
        | * {не подсоединяет* * @Internet} *
        | * {не подсоединяет* * @WiFi} *
        | * {не получ* * установить * @Internet} *
        | * {не получ* * установить * подключени*} *
        | * {не получ* * установить * соединени*} *
        | * {не получ* * установить * @WiFi} *
        | * {не предоставляет* * @Internet} *
        | * {не предоставляет* * @WiFi} *
        | * {не работа* * @Internet} *
        | * {не работа* * @WiFi} *
        | * {не рабоч* * @Internet} *
        | * {не рабоч* * @WiFi} *
        | * {не соединяет* * @Internet} *
        | * {не соединяет* * @WiFi} *
        | * {не удается * установить * @Internet} *
        | * {не удается * установить * подключени*} *
        | * {не удается * установить * соединени*} *
        | * {не удается * установить * @WiFi} *
        | * {не удалось * установить * @Internet} *
        | * {не удалось * установить * подключени*} *
        | * {не удалось * установить * соединени*} *
        | * {не удалось * установить * @WiFi} *
        | * {не устанавлив* * @Internet} *
        | * {не устанавлив* * подключени* } *
        | * {не устанавлив* * связ*} *
        | * {не устанавлив* * соединени*} *
        | * {не устанавлив* * трафик*} *
        | * {нерабоч* * @Internet} *
        | * {нерабоч* * @WiFi} *
        | * {нет @Internet * @Device} *
        | * {нет @Internet * @Place} *
        | * {нет * @WiFi} *
        | * {нет* * подключени*} *
        | * {нет* * связ*} *
        | * {нет* * соединени*} *
        | * {нету @Internet * @Device} *
        | * {нету @Internet * @Place} *
        | * {нету * @Internet} *
        | * {нету * @WiFi} *
        | * {обруби* * @Internet } *
        | * {обруби* * @WiFi} *
        | * {обруби* * подключени* * @Internet} *
        | * {обруби* * подключени* * @WiFi} *
        | * {обруби* * связ* * @Internet} *
        | * {обруби* * связ* * @WiFi} *
        | * {обруби* * соединени* * @Internet} *
        | * {обруби* * соединени* * @WiFi} *
        | * {отруби* * @Internet } *
        | * {отруби* * @WiFi} *
        | * {отруби* * подключени* * @Internet} *
        | * {отруби* * подключени* * @WiFi} *
        | * {отруби* * связ* * @Internet} *
        | * {отруби* * связ* * @WiFi} *
        | * {отруби* * соединени* * @Internet} *
        | * {отруби* * соединени* * @WiFi} *
        | * {ошиб* * @InternetErrorCodes} *
        | * {подключени* * не актив*} *
        | * {пропа* * @Internet } *
        | * {пропа* * @WiFi} *
        | * {пропа* * подключени* * @Internet} *
        | * {пропа* * подключени* * @WiFi} *
        | * {пропа* * связ* * @Internet} *
        | * {пропа* * соединени* * @Internet} *
        | * {пропа* * соединени* * @WiFi} *
        | * {связ* * не актив*} *
        | * {соединени* * не актив*} *
        | * {трафик* * не актив*} *
        | * {cдела* * работ* * @Internet} *
        | * {cдела* * работ* * @WiFi} *
        | * {$regexp<сбо[ий]> * @WiFi} *
        | * {$regexp<сбо[ий]> * @Internet} *
        | * {$regexp<сбо[ий]> * подключени*} *
        | * {$regexp<сбо[ий]> * соединени*} *
        | * {отключ* * свет*} * {включ* * @Equipment} *
        | * {отсутств* * @Internet} *
        | * {отсутств* * подключени*} *
        | * {отсутств* * подключени* * @Internet} *
        | * {отсутств* * соединени*} *
        | * {отсутств* * @WiFi} *
        | * {*платил* * где @Internet } *
        | * {*платил* * где @WiFi } *
        | * {*платил* * нет * @Internet } *
        | * {*платил* * нет * @WiFi } *
        | * {*платил* * @Internet * не появил* } *
        | * {*платил* * @WiFi * не появил* } *
        | * {*платил* * @Internet * не *работ* } *
        | * {*платил* * @WiFi * не *работ* } *
        | * {@Internet * @Must * заработать } *
        | * {@WiFi * @Must * заработать } *
        | * {подключени* * @Must * заработать } *
        | * {соединени* * @Must * заработать } *
        | * {связь * @Must * заработать } *
        | * {@Internet не восстановил*} *
        | * {@Internet не появил*} *
        | * {@WiFi не восстановил*} *
        | * {@WiFi не появил*} * )
        
    $commonIssueTV = (* { @Personal * @Television } *
        | * { @Personal * @TVSet } *
        | * { *чинит*  * @Television } *
        | * { *чинят*  * @Television } *
        | * { *чинит*  * @TVChannel } *
        | * { *чинят*  * @TVChannel } *
        | * { *чинит*  * @TVSet } *
        | * { *чинят*  * @TVSet } *
        | * { не видит * @Television } *
        | * { не настроен* * @Television } *
        | * { не настроен* * показ } *
        | * { неисправ* * @TVChannel } *
        | * { неисправ* * @TVSet } *
        | * { неисправ* * @Television } *
        | [по] [@My] @Television [@Television] [@Television]
        | [по] [@My] @TVSet [@Television]
        | * { по * (@TVSet/@Television) * *говорить } *
        | * { по * (@TVSet/@Television) * *беседовать } *
        | * { барахл* * @TVChannel } *
        | * { барахл* * @TVSet } *
        | * { барахл* * @Television } *
        | * { *глюч* * @TVChannel } *
        | * { *глюч* * @TVSet } *
        | * { *глюч* * @Television } *
        | * { еле работает * (@TVChannel/@TVSet/@Television) } *
        | * { нарушен* * (@TVChannel/@TVSet/@Television) } *
        | * { не исправ* * (@TVChannel/@TVSet/@Television) } *
        | * { неполадк* * (@TVChannel/@TVSet/@Television) } *
        | * { проблем* * (@TVChannel/@TVSet/@Television) } *
        | * { жалоб* * (@TVChannel/@TVSet/@Television) } *
        | * { сложност* * (@TVChannel/@TVSet/@Television) } *
        | * { (@Bad/$bad) * @Television } *
        | * { не запуск* * (@TVChannel/@TVSet/@Television) } *
        | * { не подключ* * (@TVChannel/@TVSet/@Television) } *
        | * { не включ* * (@TVChannel/@TVSet/@Television) } *
        | * { *ремонт* * (@TVChannel/@TVSet/@Television) } *
        | * { сломалось * @Television } *
        | * { сломался * @TVSet } *
        | * { сломались * @TVChannelPlural } *
        | * { включи* * @Television } *
        | * { возобнови* * @Television } *
        | * { провер* * (@TVChannel/@TVSet/@Television) } *
        | * { идентифицир* * (@TVSet/@Television/@TVEquipment) } *
        | * { авториз* * (@TVSet/@Television/@TVEquipment) } *
        | * { разблок* * (@TVSet/@Television/@TVEquipment) } *
        | * { висн* * видео } *
        | * { висн* * картинк* } *
        | * { висн* * @Television } *
        | * { висн* * @TVChannel } *
        | * { завис* * видео } *
        | * { завис* * картинк* } *
        | * { завис* * @Television } *
        | * { завис* * @TVChannel } *
        | * { молча* * (@TVSet/@Television/@TVEquipment) } *
        | * { молчи* * (@TVSet/@Television/@TVEquipment) } *
        | * { потух* * (@TVSet/@Television/@TVEquipment) } *
        | * { (лаг/лаги) * (@TVChannel/@TVSet/@Television) } *
        | * { лагать * (@TVChannel/@TVSet/@Television) } *
        | * { подлагива* * (@TVChannel/@TVSet/@Television) } *
        | * { лагает * (@TVChannel/@TVSet/@Television) } *
        | * { моросит * (@TVChannel/@TVSet/@Television) * не идет } *
        | * { моросит * (@TVChannel/@TVSet/@Television) * не идут } *
        | * { не подгружает* * (@TVChannel/@TVSet/@Television) } *
        | * { не прогружает* * (@TVChannel/@TVSet/@Television) } *
        | * { подвис* * (@TVChannel/@TVSet/@Television) } *
        | * { завис* * (@TVChannel/@TVSet/@Television) } *
        | * { просед* * (@TVChannel/@TVSet/@Television) } *
        | * { просел* * (@TVChannel/@TVSet/@Television) } *
        | * { просес* * (@TVChannel/@TVSet/@Television) } *
        | * { не нравится как работ* * (@TVSet/@Television)  } *
        | * { подключен* * (@TVSet/@Television) } *
        | * { @Television * не восстановил*} *
        | * { @Television * не появил*} * )

    $commonInternetNoAct = (* { взломан* * @Equipment } *
        | * { @Know * @IPaddress * [@DomRu]  } *
        | * { @Change * @IPaddress * [@DomRu]  } *
        | * { (поврежден*/испорчен*/повредил*/испортил*) *  @Equipment } *
        | * { не работает * @YandexAlisaEquipment } *
        | * { не включ* * @YandexAlisaEquipment } *
        | * { не реагир* * @YandexAlisaEquipment } *
        | * { не переключ* * @YandexAlisaEquipment } *
        | * { сломан* * @YandexAlisaEquipment } *
        | * { полома* * @YandexAlisaEquipment } *
        | * { поломк* * @YandexAlisaEquipment } *
        | * { проблем* * @YandexAlisaEquipment } *
        | * { ремонт* * @YandexAlisaEquipment } *
        | * { ошибк* * @YandexAlisaEquipment } *
        | * { (@Bad/$bad) * работ* * @YandexAlisaEquipment } *
        | * { (@Bad/$bad) * включ* * @YandexAlisaEquipment } *
        | * { (@Bad/$bad) * реагир* * @YandexAlisaEquipment } * 
        | * { откр* порт* } * 
        | * { обрыв* *волокн* } * 
        | * { оборв* *волокн* } *
        | * настрой* ди эл эн эй *
        | * { нов* провод* *делать } * )

    $commonInternetUnd = ( * { *глючит* * [качество] @Internet } *
        | * { *глючил* * [качество] @Internet } *
        | * { *глючит* * [работа] @Internet } *
        | * { *глючил* * [работа] @Internet } *
        | * { *глючит* * @WiFi } *
        | * { *глючит* * @Internet } *
        | * { *глючил* * @WiFi } *
        | * { *глючил* * @Internet } *
        | * { *глючит* * сесси* } *
        | * { *глючит* * связь } *
        | * { *глючит* * соединени* } *
        | * { *глючил* * сесси* } *
        | * { *глючил* * связь } *
        | * { *глючил* * соединени* } *
        | * { *глючит* * @Router } *
        | * { *глючил* * @Router } *
        | * { не актив* * сесси* } *
        | * { не актив* * связь } *
        | * { не актив* * соединени* } *
        | * { не актив* * подключени* } *
        | * { не актив* * @Router } *
        | * { актив* * сесси* } *
        | * { актив* * связь } *
        | * { актив* * соединени* } *
        | * { актив* * подключени* } *
        | * { актив* * @Router } *
        | * { актив* * @Internet } *
        | * { актив* * @WiFi } *
        | * { установ* * сесси* } *
        | * { установ* * связь } *
        | * { установ* * соединени* } *
        | * { установ* * подключени* } *
        | * { установ* * @Internet } *
        | * { установ* * @WiFi } *
        | * { ухудш* * сесси* } *
        | * { ухудш* * связь } *
        | * { ухудш* * соединени* } *
        | * { ухудш* * подключени* } *
        | * { ухудш* * @Router } *
        | * { ухудш* * @Internet } *
        | * { ухудш* * @WiFi } *
        | * { настр* * сесси* } *
        | * { настр* * связь } *
        | * { настр* * соединени* } *
        | * { настр* * подключени* } *
        | * { настр* * @WiFi } *
        | * { настр* * @Internet } *
        | * { восстан* * сесси* } *
        | * { восстан* * связь } *
        | * { восстан* * соединени* } *
        | * { восстан* * подключени* } *
        | * { восстан* * @Router } *
        | * { восстан* * @Internet } *
        | * { восстан* * @WiFi } *
        | * { (@WiFi/@Internet) * @DomRu } *
        | * { вопрос* * @Internet } *
        | * { консультаци* * @Internet } *
        | * { информаци* * @Internet } *
        | * { интерес* * @Internet } *
        | * { @Change * сесси* } *
        | * { @Change * связь } *
        | * { @Change * соединени* } *
        | * { @Change * подключени* } *
        | * { @Change * @Internet } *
        | * { @Change * @WiFi } *
        | * { исправ* * @Internet } *
        | * { поправ* * @Internet } *
        | * { устран* * @Internet } *
        | * { настр* * компьютер } *
        | * { заблокир* * компьютер } *
        | * { включ* * компьютер } *
        | * { настр* * ноутбук } *
        | * { заблокир* * ноутбук } *
        | * { включ* * ноутбук } *
        | * { (не загружает*/не грузит*) * сесси* } *
        | * { (не загружает*/не грузит*) * связь } *
        | * { (не загружает*/не грузит*) * соединени* } *
        | * { (не загружает*/не грузит*) * подключени* } *
        | * { (не загружает*/не грузит*) * @Router } *
        | * { (не загружает*/не грузит*) * @DomRu } *
        | * { не @Can * *пользовать* * @Internet } *
        | * { не работает * (компьютер/ноутбук) } *
        | * { не включается * (компьютер/ноутбук) } *
        | * { не активируется * (компьютер/ноутбук) } *
        | * { не показывает * (компьютер/ноутбук) } *
        | * { не подключается * (компьютер/ноутбук) } *
        | * { не загружается * (компьютер/ноутбук) } *
        | * { оборва* * сесси* } *
        | * { оборва* * связь } *
        | * { оборва* * соединени* } *
        | * { оборва* * подключени* } *
        | * { оборва* * @Router } *
        | * { оборва* * @Internet } *
        | * { оборва* * @WiFi } *
        | * { срыв* * сесси* } *
        | * { срыв* * связь } *
        | * { срыв* * соединени* } *
        | * { срыв* * подключени* } *
        | * { срыв* * @Router } *
        | * { срыв* * @Internet } *
        | * { срыв* * @WiFi } *
        | * { обрыв* * сесси* } *
        | * { обрыв* * связь } *
        | * { обрыв* * соединени* } *
        | * { обрыв* * подключени* } *
        | * { обрыв* * @Router } *
        | * { обрыв* * @Internet } *
        | * { обрыв* * @WiFi } *
        | * { параметр* * сесси* } *
        | * { параметр* * связь } *
        | * { параметр* * соединени* } *
        | * { параметр* * подключени* } *
        | * { параметр* * @Internet } *
        | * { параметр* * @WiFi } *
        | * { привяз* * сесси* } *
        | * { привяз* * связь } *
        | * { привяз* * соединени* } *
        | * { привяз* * подключени* } *
        | * { привяз* * @WiFi } *
        | * { привяз* * @Internet } *
        | * { потух* * сесси* } *
        | * { потух* * связь } *
        | * { потух* * соединени* } *
        | * { потух* * подключени* } *
        | * { потух* * @Router } *
        | * { потух* * @Internet } *
        | * { (сбой/сбои/сбоит) * сесси* } *
        | * { (сбой/сбои/сбоит) * связь } *
        | * { (сбой/сбои/сбоит) * соединени* } *
        | * { (сбой/сбои/сбоит) * подключени* } *
        | * { (сбой/сбои/сбоит) * @Internet } *
        | * { (сбой/сбои/сбоит) * @WiFi } *
        | * { (сброс*/восстановить) * сесси* } *
        | * { (сброс*/восстановить) * связь } *
        | * { (сброс*/восстановить) * соединени* } *
        | * { (сброс*/восстановить) * подключени* } *
        | * { (сброс*/восстановить) * @Internet } *
        | * { (сброс*/восстановить) * @WiFi } *
        | * { (@Bad/$bad) * сесси* } *
        | * { (@Bad/$bad) * связь } *
        | * { (@Bad/$bad) * соединени* } *
        | * { (@Bad/$bad) * подключени* } *
        | * { (@Bad/$bad) * @Router } *
        | * { (@Bad/$bad) * [качество] * @Internet } *
        | * { (@Bad/$bad) * [работ*] * @Internet } *
        | * { (@Bad/$bad) * @WiFi } *
        | * { (@Bad/$bad) * работ* * [сетевое] подключени* } *
        | * { (@Bad/$bad) * работ* * соединени* } *
        | * { (@Bad/$bad) * (ловит*/работ*) * @WiFi } *
        | * { (@Bad/$bad) * (ловит*/работ*) * @Internet } *
        | * { (@Bad/$bad) * (ловит*/работ*) * сесси* } *
        | * { (@Bad/$bad) * (ловит*/работ*) * связь } *
        | [@My] @Internet [@Internet] [@Internet] 
        | * { где (@WiFi/@Internet) } *
        | * { беспроводн* @Internet } *
        | * { никакой @Internet } *
        | * { оставляет желать * @Internet } *
        | * { никуда не годится * @Internet } *
        | * { (говн*/говен*) @Internet } *
        | * { глюч* @Internet } *
        | * { не фурыч* @Internet } *
        | * { не включается * сесси* } *
        | * { не включается * связь } *
        | * { не включается * соединени* } *
        | * { не включается * подключени* } *
        | * { не включается * @Router } *
        | * { не включается * @Internet } *
        | * { не включается * @WiFi } *
        | * { не ловит* * сесси* } *
        | * { не ловит* * связь } *
        | * { не ловит* * соединени* } *
        | * { не ловит* * подключени* } *
        | * { не ловит* * @Router } *
        | * { не ловит* * @Internet } *
        | * { не ловит* * @WiFi } *
        | * { сбил* * сесси* } *
        | * { сбил* * связь } *
        | * { сбил* * соединени* } *
        | * { сбил* * подключени* } *
        | * { сбил* * @Internet } *
        | * { сбил* * @WiFi } *
        | * { слетел* * сесси* } *
        | * { слетел* * связь } *
        | * { слетел* * соединени* } *
        | * { слетел* * подключени* } *
        | * { слетел* * @Internet } *
        | * { слетел* * @WiFi } *
        | * { сбрасыва* * сесси* } *
        | * { сбрасыва* * связь } *
        | * { сбрасыва* * соединени* } *
        | * { сбрасыва* * подключени* } *
        | * { сбрасыва* * @Internet } *
        | * { сбрасыва* * @WiFi } *
        | * { переустановить * сесси* } *
        | * { переустановить * связь } *
        | * { переустановить * соединени* } *
        | * { переустановить * подключени* } *
        | * { переустановить * @Internet } *
        | * { переустановить * @WiFi } *
        | * { перенастроить * сесси* } *
        | * { перенастроить * связь } *
        | * { перенастроить * соединени* } *
        | * { перенастроить * подключени* } *
        | * { перенастроить * @Internet } *
        | * { перенастроить * @WiFi } *
        | * { (перенастроить/переподключить) * работ* * @Internet } *
        | * { (перенастроить/переподключить) * сесси* * @Internet } *
        | * { (перенастроить/переподключить) * связь * @Internet } *
        | * { (перенастроить/переподключить) * соединени* * @Internet } *
        | * { (перенастроить/переподключить) * доступ* * @Internet } *
        | * { барахл* * сесси* } *
        | * { барахл* * связь } *
        | * { барахл* * соединени* } *
        | * { барахл* * подключени* } *
        | * { барахл* * @Internet } *
        | * { барахл* * @WiFi } *
        | * { барахл* * @Router } *
        | * { беда * сесси* } *
        | * { беда * связь } *
        | * { беда * соединени* } *
        | * { беда * подключени* } *
        | * { беда * @Internet } *
        | * { беда * @WiFi } *
        | * { беда * @Router } *
        | * { жалоб* * сесси* } *
        | * { жалоб* * связь } *
        | * { жалоб* * соединени* } *
        | * { жалоб* * подключени* } *
        | * { жалоб* * @Internet } *
        | * { жалоб* * @WiFi } *
        | * { жалоб* * @Router } *
        | * { наруш* * сесси* } *
        | * { наруш* * связь } *
        | * { наруш* * соединени* } *
        | * { наруш* * подключени* } *
        | * { наруш* * @Internet } *
        | * { наруш* * @WiFi } *
        | * { наруш* * @Router } *
        | * { не довол* * сесси* } *
        | * { не довол* * связь } *
        | * { не довол* * соединени* } *
        | * { не довол* * @Internet } *
        | * { не довол* * @WiFi } *
        | * { не довол* * @Router } *
        | * { не привяз* * сесси* } *
        | * { не привяз* * связь } *
        | * { не привяз* * соединени* } *
        | * { не привяз* * @Internet } *
        | * { не привяз* * @WiFi } *
        | * { не привяз* * @Router } *
        | * { не раздает* * сесси* } *
        | * { не раздает* * связь } *
        | * { не раздает* * соединени* } *
        | * { не раздает* * подключени* } *
        | * { не раздает* * @Internet } *
        | * { не раздает* * @WiFi } *
        | * { не раздает* * @Router } *
        | * { недовол* * сесси* } *
        | * { недовол* * связь } *
        | * { недовол* * соединени* } *
        | * { недовол* * подключени* } *
        | * { недовол* * @Internet } *
        | * { недовол* * @WiFi } *
        | * { недовол* * @Router } *
        | * { неисправ* * сесси* } *
        | * { неисправ* * связь } *
        | * { неисправ* * соединени* } *
        | * { неисправ* * подключени* } *
        | * { неисправ* * @Internet } *
        | * { неисправ* * @WiFi } *
        | * { неисправ* * @Router } *
        | * { некорректн* * соединени* } *
        | * { некорректн* * подключени* } *
        | * { некорректн* * работ* * [сетевое] подключени* } *
        | * { некорректн* * работ* * соединени* } *
        | * { некорректн* * (ловит*/работ*) * @WiFi } *
        | * { некорректн* * (ловит*/работ*) * @Internet } *
        | * { некорректн* * (ловит*/работ*) * сесси* } *
        | * { некорректн* * (ловит*/работ*) * связь } *
        | * { неполадк* * соединени* } *
        | * { неполадк* * подключени* } *
        | * { неполадк* * работ* * [сетевое] подключени* } *
        | * { неполадк* * работ* * соединени* } *
        | * { неполадк* * (ловит*/работ*) * @WiFi } *
        | * { неполадк* * (ловит*/работ*) * @Internet } *
        | * { неполадк* * (ловит*/работ*) * сесси* } *
        | * { неполадк* * (ловит*/работ*) * связь } *
        | * { непонятн* * соединени* } *
        | * { непонятн* * подключени* } *
        | * { непонятн* * работ* * [сетевое] подключени* } *
        | * { непонятн* * работ* * соединени* } *
        | * { непонятн* * (ловит*/работ*) * @WiFi } *
        | * { непонятн* * (ловит*/работ*) * @Internet } *
        | * { непонятн* * (ловит*/работ*) * сесси* } *
        | * { непонятн* * (ловит*/работ*) * связь } *
        | * { неправильн* * соединени* } *
        | * { неправильн* * подключени* } *
        | * { неправильн* * работ* * [сетевое] подключени* } *
        | * { неправильн* * работ* * соединени* } *
        | * { неправильн* * (ловит*/работ*) * @WiFi } *
        | * { неправильн* * (ловит*/работ*) * @Internet } *
        | * { неправильн* * (ловит*/работ*) * сесси* } *
        | * { неправильн* * (ловит*/работ*) * связь } *
        | * { обслуживани* * (@WiFi/@Internet) } *
        | * { ошибк* * работ* * @Internet } *
        | * { ошибк* * сесси* * @Internet } *
        | * { ошибк* * связ* * @Internet } *
        | * { ошибк* * соединени* * @Internet } *
        | * { ошибк* * подключени* * @Internet } *
        | * { ошибк* * доступ* * @Internet } *
        | * { проблем* * работ* * @Internet } *
        | * { проблем* * сесси* * @Internet } *
        | * { проблем* * связ* * @Internet } *
        | * { проблем* * соединени* * @Internet } *
        | * { проблем* * подключени* * @Internet } *
        | * { проблем* * доступ* * @Internet } *
        | * { провер* * работ* * @Internet } *
        | * { провер* * сесси* * @Internet } *
        | * { провер* * связ* * @Internet } *
        | * { провер* * соединени* * @Internet } *
        | * { провер* * подключени* * @Internet } *
        | * { провер* * доступ* * @Internet } *
        | * { провер* * работ* * @WiFi  } *
        | * { провер* * сесси* * @WiFi  } *
        | * { провер* * связ* * @WiFi  } *
        | * { провер* * соединени* * @WiFi  } *
        | * { провер* * подключени* * @WiFi  } *
        | * { провер* * доступ* * @WiFi  } *
        | * { провер* * сесси* } *
        | * { провер* * связь } *
        | * { провер* * соединени* } *
        | * { провер* * подключени* } *
        | * { провер* * @Internet } *
        | * { провер* * @WiFi } *
        | * { сложност* * сесси* } *
        | * { сложност* * связь } *
        | * { сложност* * соединени* } *
        | * { сложност* * подключени* } *
        | * { сложност* * @Internet } *
        | * { сложност* * @WiFi } *
        | * { худш* * сесси* } *
        | * { худш* * связь } *
        | * { худш* * соединени* } *
        | * { худш* * подключени* } *
        | * { худш* * @Internet } *
        | * { худш* * @WiFi } * )
        
    $commonTechnicalProblems = ( * (вернут*/верни*) * чтобы* (@DomRu/@Services/всё) * *работал*
        | * { (вернут*/верни*) * работ* * (@DomRu/@Services/всё) } *
        | * { завис* * @DomRu } *
        | * { виснет * @DomRu } *
        | * { виснут * @DomRu } *
        | * { завис* * @Services } *
        | * { виснет * @Services } *
        | * { виснут * @Services } *
        | * { завис* * всё } *
        | * { виснет * всё } *
        | * { виснут * всё } *
        | * { завис* * просмотр } *
        | * { виснет * просмотр } *
        | * { виснут * просмотр } *
        | * { не настроен* * @DomRu } *
        | * { не настроен* * @Services } *
        | * { не настроен* * всё } *
        | * { не настроен* * ничего } *
        | * { не настроен* * просмотр } *
        | * { не настро* * @DomRu } *
        | * { не настро* * @Services } *
        | * { не настро* * всё } *
        | * { не настро* * ничего } *
        | * { не настро* * просмотр } *
        | * { не настра* * @DomRu } *
        | * { не настра* * @Services } *
        | * { не настра* * всё } *
        | * { не настра* * ничего } *
        | * { не настра* * просмотр } *
        | * { не подключит* * @DomRu } *
        | * { не подключит* * @Services } *
        | * { не подключит* * всё } *
        | * { не подключит* * ничего } *
        | * { не подключит* * просмотр } *
        | * { не подключа* * @DomRu } *
        | * { не подключа* * @Services } *
        | * { не подключа* * всё } *
        | * { не подключа* * ничего } *
        | * { не подключа* * просмотр } *
        | * { не *работа* * @DomRu } *
        | * { не *работа* * @Services } *
        | * { не *работа* * всё } *
        | * { не *работа* * ничего } *
        | * { не *работа* * просмотр } *
        | * { не *работа* * @Television * @Telephone } *
        | * { @Modal * @Personal} *
        | * { @Modal * ремонт* } *
        | * { падает * @DomRu } *
        | * { падает * @Services } *
        | * { падает * всё } *
        | * { падает * просмотр } *
        | * { скач* * @DomRu } *
        | * { скач* * @Services } *
        | * { скач* * всё } *
        | * { скач* * просмотр } *
        | * { прыг* * @DomRu } *
        | * { прыг* * @Services } *
        | * { прыг* * всё } *
        | * { прыг* * просмотр } *
        | * { (*сылать/отправ*/*слать) * (@Personal/специалист*) } *
        | * { (выслать/вышли*/высыла*) * (@Personal/специалист*) } *
        | * { (выслать/вышли*/высыла*) * (@Personal/специалист*) } *
        | * { (послать/пошли*/посыла*) * (@Personal/специалист*) } * 
        | * { (прислать/*шлите) * (@Personal/специалист*)} *
        | техническ*
        | * $techSupport *
        | * { вызов* * @Personal * [@Place] } *
        | * { вызыв* * @Personal * [@Place] } *
        | * { вызва* * @Personal * [@Place] } *
        | * { позвони* * @Personal} *
        | * { вызов* * специалист* * @Place } *
        | * { вызыв* * специалист* * @Place } *
        | * { вызва* * специалист* * @Place } *
        | * { (связ*/свяж*) * @Personal} *
        | * { *чинят* * @DomRu } *
        | * { *чинят* * @Services } *
        | * { *чинят* * всё } *
        | * { *чинят* * ничего } *
        | * { *чинят* * просмотр } *
        | * { *чинит* * @DomRu } *
        | * { *чинит* * @Services } *
        | * { *чинит* * всё } *
        | * { *чинит* * ничего } *
        | * { *чинит* * просмотр } *
        | * { *глючил* * @DomRu } *
        | * { *глючил* * @Services } *
        | * { *глючил* * всё } *
        | * { *глючит* * просмотр } *
        | * { *глючит* * @DomRu } *
        | * { *глючит* * @Services } *
        | * { *глючит* * всё } *
        | * { *глючит* * просмотр } *
        | * { авари* * (@DomRu/@Services) } *
        | * { не актив* * @DomRu } *
        | * { не актив* * @Services } *
        | * { не актив* * всё } *
        | * { не актив* * ничего } *
        | * { не актив* * просмотр } *
        | * { не включ* * @DomRu } *
        | * { не включ* * @Services } *
        | * { не включ* * всё } *
        | * { не включ* * ничего } *
        | * { не включ* * просмотр } *
        | * { не показыв* * @DomRu } *
        | * { не показыв* * @Services } *
        | * { не показыв* * всё } *
        | * { не показыв* * ничего } *
        | * { не показыв* * просмотр } *
        | * { не реагир* * @DomRu } *
        | * { не реагир* * @Services } *
        | * { не реагир* * всё } *
        | * { не реагир* * ничего } *
        | * { не реагир* * просмотр } *
        | * { недоступ* * @DomRu } *
        | * { недоступ* * @Services } *
        | * { недоступ* * всё } *
        | * { недоступ* * ничего } *
        | * { недоступ* * просмотр } *
        | * { недоступ* * компьютер } *
        | * { *чинит* * @DomRu } *
        | * { *чинит* * @Services } *
        | * { *чинит* * всё } *
        | * { *чинит* * ничего } *
        | * { *чинит* * просмотр } *
        | * { неисправн* * @Internet * @Telephone } *
        | * { неисправн* * @Internet * @Television * @Telephone } *
        | * { неисправн* * @Television * @Internet } *
        | * { неисправн* * @Television * @Telephone } *
        | * { нет доступ* * @DomRu } *
        | * { нет доступ* * @Services } *
        | * { нет доступ* * всё } *
        | * { нет доступ* * ничего } *
        | * { нет доступ* * просмотр } *
        | * { нет доступ* * компьютер } *
        | * { ошибк* * @DomRu } *
        | * { ошибк* * @Services } *
        | * { ошибк* * всё } *
        | * { ошибк* * ничего } *
        | * { ошибк* * просмотр } *
        | * { ошибк* * компьютер } *
        | * { перезагруз* * @DomRu } *
        | * { перезагруз* * @Services } *
        | * { перезагруз* * всё } *
        | * { перезагруз* * ничего } *
        | * { перезагруз* * просмотр } *
        | * { перезагруз* * компьютер } *
        | * заплатил* * за @AllServices * до сих пор * не подключили *
        | * когда * { возобнов* * @DomRu } *
        | * когда * { возобнов* * @Services } *
        | * когда * { возобнов* * всё } *
        | * когда * { возобнов* * просмотр } *
        | * когда * { восстанов* * @DomRu } *
        | * когда * { восстанов* * @Services } *
        | * когда * { восстанов* * всё } *
        | * когда * { восстанов* * просмотр } *
        | * когда * { заработа* * @DomRu } *
        | * когда * { заработа* * @Services } *
        | * когда * { заработа* * всё } *
        | * когда * { заработа* * просмотр } *
        | * когда * { работа* @DomRu } *
        | * когда * { работа* @Services } *
        | * когда * { работа* всё } *
        | * когда * { работа* просмотр } *
        | * { когда * будет * связь } *
        | * { когда * будет @DomRu } *
        | * почему { *блокир* @DomRu } *
        | * почему { *блокир* @Services } *
        | * почему { *блокир* всё } *
        | * почему { *блокир* просмотр } *
        | * { помех* * @Cable } *
        | * не работает * @duckling.number ~день * @Television * @Internet *
        | * не работает * @duckling.ordinal ~день * @Television * @Internet *
        | {$no не восстановил*}
        | {$no не появил*}
        | {$no  доступ*}
        | не доступ*
        | {$no услуг*}
        | {(все/всё/ничего/нихрена/нихера/нифига) не работает}
        | {услуг* не (работает/работают/заработал*)}
        | {(все/всё/ничего/нихрена/нихера/нифига) не восстановилось}
        | {услуг* не восстановил*}
        | {доступ* не восстановил*}
        | {услуг* не появил*}
        | {доступ* не появил*}
        | {(все/всё/ничего/нихрена/нихера/нифига) не заработало}
        | {доступ* не (работает/работают/заработал*)}
        | (не работает/не работают/не заработал*/не восстановил*)
        | { (ничего/нихрена/нихера/нифига) * не (открываются/открыл*/открывает*) }
        | { (ничего/нихрена/нихера/нифига) * не (работает/заработал*/*ключает*/*ключил*) }
        | { не (установилось/установилась) }
        | * { активир* * @Services } *
        | * { активац* * @Services } * 
        | * {$regexp<отключ(ен|ены|ена|ено)> * @DomRu } * )

    $lowSpeed = ( * { слаб* * работ* * @Internet } *
        | * { слаб* * ~сессия * @Internet } *
        | * { слаб* * ~связь * @Internet } *
        | * { слаб* * соедин* * @Internet } *
        | * { слаб* * подключ* * @Internet } *
        | * { слаб* * доступ* * @Internet } *
        | * { слаб* * работ* * @InternetEquipment } *
        | * { слаб* * ~сессия * @InternetEquipment } *
        | * { слаб* * ~связь * @InternetEquipment } *
        | * { слаб* * соедин* * @InternetEquipment } *
        | * { слаб* * подключ* * @InternetEquipment } *
        | * { слаб* * доступ* * @InternetEquipment } *
        | * { слаб* * работ* * @WiFi } *
        | * { слаб* * ~сессия * @WiFi } *
        | * { слаб* * ~связь * @WiFi } *
        | * { слаб* * соедин* * @WiFi } *
        | * { слаб* * подключ* * @WiFi } *
        | * { слаб* * доступ* * @WiFi } *
        | * { (еле/едва) * ползает * @Internet } *
        | * { (еле/едва) * ползает * скорост* } *
        | * { (еле/едва) * работает * @Internet } *
        | * { (еле/едва) * работает * скорост* } *
        | * { (еле/едва) * работает * трафик* } *
        | * { (не прогружает/не прогружается) * трафик* } *
        | * { (нет/нету) * скорост* } *
        | * { (падени*/упал*/падает) * @Internet } *
        | * { (падени*/упал*/падает) * скорост* } *
        | * { (падение/упал*/падает) * трафик* } *
        | * { (подвисани*/подвисл*) * @Internet } *
        | * { (подвисани*/подвисл*) * скорост* } *
        | * { (пропад*/пропал*) * скорост* } *
        | * { (просед*/просид*/просел*) * @Internet } *
        | * { (просед*/просид*/просел*) * скорост* } *
        | * { (проседает/просидает/просел*) * трафик* } *
        | * { висн* * @Internet } *
        | * { висн* * сессия } *
        | * { висн* * скорост* } *
        | * { висн* * соединение } *
        | * { висн* * трафик* } *
        | * { входящ* * скорост* * *меньше } *
        | * { входящ* * скорост* * *ниже* } *
        | * { где скорост* } *
        | * { добав* * скорост* } *
        | * { @Slow * *груж* * @Internet } *
        | * { @Slow * *груж* * скорост* } *
        | * { @Slow * *груз* * @Internet } *
        | * { @Slow * *груз* * скорост* } *
        | * { (@Bad/$bad) * *груж* * @Internet } *
        | * { (@Bad/$bad) * *груж* * скорост* } *
        | * { @Slow * *груж* * @Internet } *
        | * { @Slow * *груж* * скорост* } *
        | * { @Slow * *груз* * @Internet } *
        | * { @Slow * *груз* * скорост* } *
        | * { @Slow * загружает* * видео } *
        | * { @Slow * загружает* * картинк* } *
        | * { @Slow * загружает* * сайт* } *
        | * { @Slow * загружает* * страниц* } *
        | * { @Slow * загружает* * фильм* } *
        | * { @Slow * загружает* * фото* } *
        | * { @Slow * открывает* * видео } *
        | * { @Slow * открывает* * картинк* } *
        | * { @Slow * открывает* * сайт* } *
        | * { @Slow * открывает* * страниц* } *
        | * { @Slow * открывает* * фильм* } *
        | * { @Slow * открывает* * фото* } *
        | * { завис* * @Internet } *
        | * { завис* * сессия } *
        | * { завис* * скорост* } *
        | * { завис* * соединение } *
        | * { завис* * трафик* } *
        | * { задержк* * @Internet } *
        | * { задержк* * сигнал* } *
        | * { задержк* * скорост* } *
        | * { заявлен* * скорост* * *меньше } *
        | * { заявлен* * скорост* * *ниже* } *
        | * { лаг * скорост* } *
        | * { лаг * трафик* } *
        | * { лагает * скорост* } *
        | * { лагает * трафик* } *
        | * { лаги * скорост* } *
        | * { лаги * трафик* } *
        | * { малая * скорост*} *
        | * { маленьк* * скорост*} *
        | * { медленн* * скорост* } *
        | * { @Slow * грузит* * видео } *
        | * { @Slow * грузит* * картинк* } *
        | * { @Slow * грузит* * сайт* } *
        | * { @Slow * грузит* * страниц* } *
        | * { @Slow * грузит* * фильм* } *
        | * { @Slow * грузит* * фото* } *
        | * { @Slow * работа* * видео } *
        | * { @Slow * работа* * картинк* } *
        | * { @Slow * работа* * сайт* } *
        | * { @Slow * работа* * страниц* } *
        | * { @Slow * работа* * фильм* } *
        | * { @Slow * работа* * фото* } *
        | * { @Slow * работа* * скорост* } *
        | * { @Slow * работа* * (@Internet/@WiFi) } *
        | * { моросит * скорост* } *
        | * { не прогруж* * @Internet } *
        | * { не прогруж* * скорост* } *
        | * { не соответствует * скорост* [@Tariff]} *
        | * { не соответствует * трафик* [@Tariff]} *
        | * { не тянет * @Internet } *
        | * { не тянет * видео } *
        | * { не тянет * картинк* } *
        | * { не тянет * сайт* } *
        | * { не тянет * страниц* } *
        | * { не тянет * фильм* } *
        | * { не тянет * фото* } *
        | * { небольш* * скорост*} *
        | * { нижайш* * скорост*} *
        | * { низк* * скорост*} *
        | * { обещанн* * скорост* * *меньше } *
        | * { обещанн* * скорост* * *ниже* } *
        | * { ограничил* * @Internet } *
        | * { ограничил* * скорост* } *
        | * { ограничил* * трафик* } *
        | * { @Slow * скорост*} *
        | * { перебои * скорост* } *
        | * { (@Bad/$bad) * грузит* * видео } *
        | * { (@Bad/$bad) * грузит* * картинк* } *
        | * { (@Bad/$bad) * грузит* * сайт* } *
        | * { (@Bad/$bad) * грузит* * страниц* } *
        | * { (@Bad/$bad) * грузит* * фильм* } *
        | * { (@Bad/$bad) * грузит* * фото* } *
        | * { (@Bad/$bad) * загружает* * видео } *
        | * { (@Bad/$bad) * загружает* * картинк* } *
        | * { (@Bad/$bad) * загружает* * сайт* } *
        | * { (@Bad/$bad) * загружает* * страниц* } *
        | * { (@Bad/$bad) * загружает* * фильм* } *
        | * { (@Bad/$bad) * загружает* * фото* } *
        | * { (@Bad/$bad) * открывает* * видео } *
        | * { (@Bad/$bad) * открывает* * картинк* } *
        | * { (@Bad/$bad) * открывает* * сайт* } *
        | * { (@Bad/$bad) * открывает* * страниц* } *
        | * { (@Bad/$bad) * открывает* * фильм* } *
        | * { (@Bad/$bad) * открывает* * фото* } *
        | * { подвисани* * видео } *
        | * { подвисани* * картинк* } *
        | * { подвисани* * сайт* } *
        | * { подвисани* * страниц* } *
        | * { подвисани* * фильм* } *
        | * { подвисани* * фото* } *
        | * { подвисл* * видео } *
        | * { подвисл* * картинк* } *
        | * { подвисл* * сайт* } *
        | * { подвисл* * страниц* } *
        | * { подвисл* * фильм* } *
        | * { подвисл* * фото* } *
        | * { *лагивает * скорост* } *
        | * { *лагивает * трафик* } *
        | * { *тормаж* * скорост*} *
        | * { *тормоз* * скорост*} *
        | * { *тормаж* * (@Internet/@WiFi)} *
        | * { *тормоз* * (@Internet/@WiFi)} *
        | * { просадк* * скорост* } *
        | * { противн* * скорост*} *
        | * { скорост* * не соответств* * заявленн* } *
        | * { слаб* * скорост*} *
        | * { снизил* * скорост*} *
        | * { снизил* * трафик*} *
        | * { *тормоз* * видео } *
        | * { *тормоз* * картинк* } *
        | * { *тормоз* * сайт* } *
        | * { *тормоз* * страниц* } *
        | * { *тормоз* * фильм* } *
        | * { *тормоз* * фото* } *
        | * { *тормож* * видео } *
        | * { *тормож* * картинк* } *
        | * { *тормож* * сайт* } *
        | * { *тормож* * страниц* } *
        | * { *тормож* * фильм* } *
        | * { *тормож* * фото* } *
        | * { уменьш* * @Internet } *
        | * { уменьш* * скорост* } *
        | * { черепаха * скорост*} *
        | * { черепаш* * скорост*} *
        | * { нечего не *груз*} *
        | * { нечего не *груж*} * 
        | * { @Know * (скорост* работ*) (@Internet/@WiFi/@Router)} * )

    $connectProblem = ( * { @WiFi * то есть то нет } *
        | * { @Internet * то есть то нет } *
        | * { сесси* * то есть то нет } *
        | * { связ* * то есть то нет } *
        | * { (сеть/сети) * то есть то нет } *
        | * { соединени* * то есть то нет } *
        | * { подключени* * то есть то нет } *
        | * { перебо* * соединени* * @InternetEquipment } *
        | * { перебо* * подключен* * @InternetEquipment } *
        | * { перебо* * связ* * @InternetEquipment } *
        | * { перебо* * сигнал* * @InternetEquipment } *
        | * { выбрасыва* * @WiFi } *
        | * { выбрасыва* * @Internet } *
        | * { выбрасыва* * сесси* } *
        | * { выбрасыва* * связ* } *
        | * { выбрасыва* * (сеть/сети) } *
        | * { выбрасыва* * соединени* } *
        | * { выбрасыва* * подключени* } *
        | * { выкидыва* * @WiFi } *
        | * { выкидыва* * @Internet } *
        | * { выкидыва* * сесси* } *
        | * { выкидыва* * связ* } *
        | * { выкидыва* * (сеть/сети) } *
        | * { выкидыва* * соединени* } *
        | * { выкидыва* * подключени* } *
        | * { вылета* * @WiFi } *
        | * { вылета* * @Internet } *
        | * { вылета* * сесси* } *
        | * { вылета* * связ* } *
        | * { вылета* * (сеть/сети) } *
        | * { вылета* * соединени* } *
        | * { вылета* * подключени* } *
        | * { нестабильн* * @Router } *
        | * { нестабильн* * [качество] * @Internet } *
        | * { нестабильн* * [работ*] * @Internet } *
        | * { нестабильн* * работ* * [сетевое] подключени* } *
        | * { нестабильн* * работ* * соединени* } *
        | * { нестабильн* * (ловит*/работ*) * @WiFi } *
        | * { нестабильн* * (ловит*/работ*) * @Internet } *
        | * { нестабильн* * (ловит*/работ*) * сесси* } *
        | * { нестабильн* * (ловит*/работ*) * связь } *
        | * { @BadAdv * ловит* * @WiFi } *
        | * { @BadAdv * ловит* * @Internet } *
        | * { @BadAdv * ловит* * сесси* } *
        | * { @BadAdv * ловит* * связь } *
        | * { нестабильн* * соединени* * [@InternetEquipment] } *
        | * { нестабильн* * подключен* * [@InternetEquipment] } *
        | * { нестабильн* * связ* * @InternetEquipment } *
        | * { нестабильн* * сигнал* * @InternetEquipment } *
        | * { нестабильн* * [соединени*] * @WiFi } *
        | * { нестабильн* * [соединени*] * @Internet } *
        | * { нестабильн* * [соединени*] * сесси* } *
        | * { нестабильн* * [соединени*] * связ* } *
        | * { нестабильн* * [соединени*] * сеть } *
        | * { нестабильн* * [соединени*] * сети } *
        | * { нестабильн* * [подключен*] * @WiFi } *
        | * { нестабильн* * [подключен*] * @Internet } *
        | * { нестабильн* * [подключен*] * сесси* } *
        | * { нестабильн* * [подключен*] * связ* } *
        | * { нестабильн* * [подключен*] * сеть } *
        | * { нестабильн* * [подключен*] * сети } *
        | * { нестабильн* * [связ*] * @WiFi } *
        | * { нестабильн* * [связ*] * @Internet } *
        | * { нестабильн* * [связ*] * сесси* } *
        | * { нестабильн* * [связ*] * сеть } *
        | * { нестабильн* * [связ*] * сети } *
        | * { постоянно * отключается * соединени* } *
        | * { постоянно * отключается * подключен* } *
        | * { постоянно * отключается * связ* } *
        | * { постоянно * отключается * @WiFi } *
        | * { постоянно * отключается * @Internet } *
        | * { постоянно * отключается * сесси* } *
        | * { постоянно * отключается * сеть } *
        | * { постоянно * отключается * сети } *
        | * { постоянно * отключается * @InternetEquipment } *
        | * { потерян* * соединени* * @Internet} *
        | * { потерян* * подключен* * @Internet} *
        | * { потерян* * связ* * @Internet} *
        | * { потерян* * соединени* * @InternetEquipment} *
        | * { потерян* * подключен* * @InternetEquipment} *
        | * { потерян* * связ* * @InternetEquipment} *
        | * { пропада* * @WiFi } *
        | * { пропада* * @Internet } *
        | * { пропада* * cесси* } *
        | * { пропада* * связ* } *
        | * { пропада* * (сеть/сети) } *
        | * { пропада* * соединени* } *
        | * { пропада* * соединени* * @InternetEquipment } *
        | * { пропада* * подключен* * @InternetEquipment } *
        | * { пропада* * связ* * @InternetEquipment } *
        | * { пропада* * сигнал* * @InternetEquipment } *
        | * { сбрасывает* * @WiFi } *
        | * { сбрасывает* * @Internet } *
        | * { сбрасывает* * сесси* } *
        | * { сбрасывает* * связ* } *
        | * { сбрасывает* * (сеть/сети) } *
        | * { сбрасывает* * соединени* } *
        | * { сбрасывает* * подключени* } *
        | * { теряется * @WiFi } *
        | * { теряется * @Internet } *
        | * { теряется * сесси* } *
        | * { теряется * связ* } *
        | * { теряется * (сеть/сети) } *
        | * { теряется * соединени* } *
        | * { теряется * подключени* } *
        | * { теряется * соединени* * @InternetEquipment } *
        | * { теряется * подключен* * @InternetEquipment } *
        | * { теряется * связ* * @InternetEquipment } *
        | * { теряется * сигнал* * @InternetEquipment } *
        | * { рвется * @WiFi } *
        | * { рвется * @Internet } *
        | * { рвется * сесси* } *
        | * { рвется * (сеть/сети) } *
        | * { рвется * соединени* } *
        | * { рвется * подключен* } *
        | * { рвется * связ* } *
        | * { разрыв* * @WiFi } *
        | * { разрыв* * @Internet } *
        | * { разрыв* * сесси* } *
        | * { разрыв* * (сеть/сети) } *
        | * { разрыв* * соединени* } *
        | * { разрыв* * подключен* } *
        | * { разрыв* * связ* } *
        | * { потерян* * @WiFi } *
        | * { потерян* * @Internet } *
        | * { потерян* * cесси* } *
        | * { потерян* * связ* } *
        | * { потерян* * (сеть/сети) } *
        | * { потерян* * соединени* } *
        | * { потерян* * подключение* } *
        | * { прерывает* * @WiFi } *
        | * { прерывает* * @Internet } *
        | * { прерывает* * сесси* } *
        | * { прерывает* * (сеть/сети) } *
        | * { прерывает* * соединени* } *
        | * { прерывает* * подключени* } *
        | * { прерван* * @WiFi } *
        | * { прерван* * @Internet } *
        | * { прерван* * сесси* } *
        | * { прерван* * (сеть/сети) } *
        | * { прерван* * соединени* } *
        | * { прерван* * подключени* } *)

    $tvQualityProblem  = ( * { (@Bad/$bad) качество * @Television} *
        | * { (@Bad/$bad) качество * @TVSet} *
        | * { (@Bad/$bad) качество * @TVChannel} *
        | * { (@Bad/$bad) качество * экран* * [@TVSet] } *
        | * { (@Bad/$bad) показывает * @Television } *
        | * { (@Bad/$bad) показывает * @TVSet } *
        | * { (@Bad/$bad) показывает * @TVEquipment } *
        | * { (@Bad/$bad) качество * видео } *
        | * { (@Bad/$bad) качество * разрешени* } *
        | * { (@Bad/$bad) качество * пропорци* } *
        | * { (@Bad/$bad) качество * звук* } *
        | * { (@Bad/$bad) качество * изображени* } *
        | * { (@Bad/$bad) работ* * видео } *
        | * { (@Bad/$bad) работ* * разрешени* } *
        | * { (@Bad/$bad) работ* * пропорци* } *
        | * { (@Bad/$bad) работ* * звук* } *
        | * { (@Bad/$bad) работ* * изображени* } *
        | * { (@Bad/$bad) * видео * (@Television/@TVSet) } *
        | * { (@Bad/$bad) * звук* * (@Television/@TVSet) } *
        | * { (@Bad/$bad) * качеств* * (@Television/@TVSet) } *
        | * { (@Bad/$bad) * картинк* * (@Television/@TVSet) } *
        | * { (@Bad/$bad) * изображени* * (@Television/@TVSet) } *
        | * { видео * без * звук* [дорожк*] } *
        | * { пропад* * звук* [дорожк*] } *
        | * { пропал* * звук* [дорожк*] } *
        | * { пропаж* * звук* [дорожк*] } *
        | * { картинк* * без * звук* [дорожк*] } *
        | * { изображени* * без * звук* [дорожк*] } *
        | * { @TVChannel * без * звук* [дорожк*] } *
        | * { искажен* * экран* * [@TVSet] } *
        | * { искажен* * видео } *
        | * { искажен* * разрешени* } *
        | * { искажен* * пропорци* } *
        | * { искажен* * звук* } *
        | * { искажен* * качеств* } *
        | * { искажен* * картинк* } *
        | * { искажен* * изображени* } *
        | * { искажает* * экран* * [@TVSet] } *
        | * { искажает* * видео } *
        | * { искажает* * разрешени* } *
        | * { искажает* * пропорци* } *
        | * { искажает* * звук* } *
        | * { искажает* * качеств* } *
        | * { искажает* * картинк* } *
        | * { искажает* * изображени* } *
        | * { исчез* * появляется * звук* } *
        | * { исчез* * появляется * картинк* } *
        | * { исчез* * появляется * изображени* } *
        | * { (не исправ*/неисправ*) * видео * @Television } *
        | * { (не исправ*/неисправ*) * разрешени* * @Television } *
        | * { (не исправ*/неисправ*) * пропорци* * @Television } *
        | * { (не исправ*/неисправ*) * звук* * @Television } *
        | * { (не исправ*/неисправ*) * качеств* * @Television } *
        | * { (не исправ*/неисправ*) * картинк* * @Television } *
        | * { (не исправ*/неисправ*) * изображени* * @Television } *
        | * { (нет/нету) * видео * @TVChannel } *
        | * { (нет/нету) * картинк* * @TVChannel } *
        | * { (нет/нету) * изображени* * @TVChannel } *
        | * { рябит * @Television } *
        | * { рябит * @TVSet } *
        | * { рябь * @Television } *
        | * { рябь * @TVSet } *
        | * { рябит * экран* * [@TVSet] } *
        | * { рябь * экран* * [@TVSet] } *
        | * { беда * видео * (@Television/@TVSet) } *
        | * { беда * разрешени* * (@Television/@TVSet) } *
        | * { беда * пропорци* * (@Television/@TVSet) } *
        | * { беда * звук* * (@Television/@TVSet) } *
        | * { беда * качеств* * (@Television/@TVSet) } *
        | * { беда * картинк* * (@Television/@TVSet) } *
        | * { беда * изображени* * (@Television/@TVSet) } *
        | * { *двоит* * видео * (@Television/@TVSet) } *
        | * { *двоит* * звук* * (@Television/@TVSet) } *
        | * { *двоит* * качеств* * (@Television/@TVSet) } *
        | * { *двоит* * картинк* * (@Television/@TVSet) } *
        | * { *двоит* * изображени* * (@Television/@TVSet) } *
        | * { *дваив* * видео * (@Television/@TVSet) } *
        | * { *дваив* * звук* * (@Television/@TVSet) } *
        | * { *дваив* * качеств* * (@Television/@TVSet) } *
        | * { *дваив* * картинк* * (@Television/@TVSet) } *
        | * { *дваив* * изображени* * (@Television/@TVSet) } *
        | * { двойн* * видео * (@Television/@TVSet) } *
        | * { двойн* * звук* * (@Television/@TVSet) } *
        | * { двойн* * картинк* * (@Television/@TVSet) } *
        | * { двойн* * изображени* * (@Television/@TVSet) } *
        | * { жалоб* * видео * (@Television/@TVSet) } *
        | * { жалоб* * разрешени* * (@Television/@TVSet) } *
        | * { жалоб* * пропорци* * (@Television/@TVSet) } *
        | * { жалоб* * звук* * (@Television/@TVSet) } *
        | * { жалоб* * качеств* * (@Television/@TVSet) } *
        | * { жалоб* * картинк* * (@Television/@TVSet) } *
        | * { жалоб* * изображени* * (@Television/@TVSet) } *
        | * { квадрат* * видео * (@Television/@TVSet) } *
        | * { квадрат* * разрешени* * (@Television/@TVSet) } *
        | * { квадрат* * пропорци* * (@Television/@TVSet) } *
        | * { квадрат* * качеств* * (@Television/@TVSet) } *
        | * { квадрат* * картинк* * (@Television/@TVSet) } *
        | * { квадрат* * изображени* * (@Television/@TVSet) } *
        | * { квадрат* * экран* * [@TVSet] } *
        | * { квадрат* * @TVChannel * @TVSet } *
        | * { квадрат* * @Television} *
        | * { клетк* * видео * (@Television/@TVSet) } *
        | * { клетк* * разрешени* * (@Television/@TVSet) } *
        | * { клетк* * пропорци* * (@Television/@TVSet) } *
        | * { клетк* * качеств* * (@Television/@TVSet) } *
        | * { клетк* * картинк* * (@Television/@TVSet) } *
        | * { клетк* * изображени* * (@Television/@TVSet) } *
        | * { клетк* * экран* * [@TVSet] } *
        | * { клетк* * @TVChannel * @TVSet } *
        | * { клетк* * @Television} *
        | * { кубик* * видео * (@Television/@TVSet) } *
        | * { кубик* * разрешени* * (@Television/@TVSet) } *
        | * { кубик* * пропорци* * (@Television/@TVSet) } *
        | * { кубик* * качеств* * (@Television/@TVSet) } *
        | * { кубик* * картинк* * (@Television/@TVSet) } *
        | * { кубик* * изображени* * (@Television/@TVSet) } *
        | * { кубик* * экран* * [@TVSet] } *
        | * { кубик* * @TVChannel * @TVSet } *
        | * { кубик* * @Television} *
        | * { наложени* * видео } *
        | * { наложени* * картинк* } *
        | * { наложени* * @Television } *
        | * { наложени* * @TVChannel } *
        | * { нарушени* * видео * (@Television/@TVSet) } *
        | * { нарушени* * разрешени* * (@Television/@TVSet) } *
        | * { нарушени* * пропорци* * (@Television/@TVSet) } *
        | * { нарушени* * звук* * (@Television/@TVSet) } *
        | * { нарушени* * качеств* * (@Television/@TVSet) } *
        | * { нарушени* * картинк* * (@Television/@TVSet) } *
        | * { нарушени* * изображени* * (@Television/@TVSet) } *
        | * { недовол* * видео * (@Television/@TVSet) } *
        | * { недовол* * разрешени* * (@Television/@TVSet) } *
        | * { недовол* * пропорци* * (@Television/@TVSet) } *
        | * { недовол* * звук* * (@Television/@TVSet) } *
        | * { недовол* * качеств* * (@Television/@TVSet) } *
        | * { недовол* * картинк* * (@Television/@TVSet) } *
        | * { недовол* * изображени* * (@Television/@TVSet) } *
        | * { неполадк* * видео * (@Television/@TVSet) } *
        | * { неполадк* * разрешени* * (@Television/@TVSet) } *
        | * { неполадк* * пропорци* * (@Television/@TVSet) } *
        | * { неполадк* * звук* * (@Television/@TVSet) } *
        | * { неполадк* * качеств* * (@Television/@TVSet) } *
        | * { неполадк* * картинк* * (@Television/@TVSet) } *
        | * { неполадк* * изображени* * (@Television/@TVSet) } *
        | * { неустойчив* * видео * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * разрешени* * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * пропорци* * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * звук* * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * качеств* * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * картинк* * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * изображени* * (@TVChannelName@TVChannel) } *
        | * { неустойчив* * работ* * (@TVChannelName@TVChannel) } *
        | * { отсутству* * звук* [дорожк*] * видео} *
        | * { отсутству* * звук* [дорожк*] * картинк*} *
        | * { отсутству* * звук* [дорожк*] * изображени*} *
        | * { отсутству* * звук* [дорожк*] * @TVChannel} *
        | * { пиксел* * видео * (@Television/@TVSet) } *
        | * { пиксел* * разрешени* * (@Television/@TVSet) } *
        | * { пиксел* * пропорци* * (@Television/@TVSet) } *
        | * { пиксел* * качеств* * (@Television/@TVSet) } *
        | * { пиксел* * картинк* * (@Television/@TVSet) } *
        | * { пиксел* * изображени* * (@Television/@TVSet) } *
        | * { пиксел* * экран* * [@TVSet] } *
        | * { пиксел* * @TVChannel * @TVSet } *
        | * { пиксел* * @Television} *
        | * { подвис* * экран* * [@TVSet] } *
        | * { помех* * (@Television/@TVSet) } *
        | * { помех* * экран* * [@TVSet] } *
        | * { помех* * @TVChannel } *
        | * { прерывается * сигнал * (@Television/@TVSet) } *
        | * { претензи* * видео * (@Television/@TVSet) } *
        | * { претензи* * разрешени* * (@Television/@TVSet) } *
        | * { претензи* * пропорци* * (@Television/@TVSet) } *
        | * { претензи* * звук* * (@Television/@TVSet) } *
        | * { претензи* * качеств* * (@Television/@TVSet) } *
        | * { претензи* * картинк* * (@Television/@TVSet) } *
        | * { претензи* * изображени* * (@Television/@TVSet) } *
        | * { проблем* * видео * (@Television/@TVSet) } *
        | * { проблем* * разрешени* * (@Television/@TVSet) } *
        | * { проблем* * пропорци* * (@Television/@TVSet) } *
        | * { проблем* * звук* * (@Television/@TVSet) } *
        | * { проблем* * качеств* * (@Television/@TVSet) } *
        | * { проблем* * картинк* * (@Television/@TVSet) } *
        | * { проблем* * изображени* * (@Television/@TVSet) } *
        | * { сложност* * видео * (@Television/@TVSet) } *
        | * { сложност* * разрешени* * (@Television/@TVSet) } *
        | * { сложност* * пропорци* * (@Television/@TVSet) } *
        | * { сложност* * звук* * (@Television/@TVSet) } *
        | * { сложност* * качеств* * (@Television/@TVSet) } *
        | * { сложност* * картинк* * (@Television/@TVSet) } *
        | * { сложност* * изображени* * (@Television/@TVSet) } *
        | * { стоп кадр* * (@Television/@TVSet) } *
        | * { стоп кадр* * экран* * [@TVSet] } *
        | * { не устраивает * качество * (@Television/@TVSet)} *
        | * { не устраивает * качество * @TVChannel} *
        | * { не устраивает * качество * экран* * @TVSet } *
        | * { (нет/нету) * звук* * @TVChannel } *
        | * { (нет/нету) * звук* * @TVSet } *
        | * { (нет/нету) * звук* * @Television } *
        | * { (нет/нету) * звук* * видео } *
        | * { (нет/нету) * звук* * картинк* } *
        | * { (нет/нету) * звук* * изображени* } *
        | * { некачеств* * видео * (@Television/@TVSet) } *
        | * { некачеств* * разрешени* * (@Television/@TVSet) } *
        | * { некачеств* * пропорци* * (@Television/@TVSet) } *
        | * { некачеств* * звук* * (@Television/@TVSet) } *
        | * { некачеств* * картинк* * (@Television/@TVSet) } *
        | * { некачеств* * изображени* } * )

    $pageNotOpen = ( * { ошибк* * @WebBrowser } *
        | * { всё * не откры* * @WebBrowser } *
        | * { всё * не откры* * @Website } *
        | * { (не @Successful) * войти * @WebBrowser } *
        | * { (не @Successful) * войти * @Website } *
        | * { (не @Successful) * загруж* * @WebBrowser } *
        | * { (не @Successful) * загруж* * @Website } *
        | * { (не @Successful) * загруз* * @WebBrowser } *
        | * { (не @Successful) * загруз* * @Website } *
        | * { (не @Successful) * откры* * @WebBrowser } *
        | * { (не @Successful) * откры* * @Website } *
        | * { (не @Successful) * подгруж* * @WebBrowser } *
        | * { (не @Successful) * подгруж* * @Website } *
        | * { (не @Successful) * подгруз* * @WebBrowser } *
        | * { (не @Successful) * подгруз* * @Website } *
        | * { (не @Successful) * перейти * @WebBrowser } *
        | * { (не @Successful) * перейти * @Website } *
        | * { не войти * @WebBrowser } *
        | * { не войти * @Website } *
        | * { не загруж* * @WebBrowser } *
        | * { не загруж* * @Website } *
        | * { не загруз* * @WebBrowser } *
        | * { не загруз* * @Website } *
        | * { не откры* * @WebBrowser } *
        | * { не откры* * @Website } *
        | * { не подгруж* * @WebBrowser } *
        | * { не подгруж* * @Website } *
        | * { не подгруз* * @WebBrowser } *
        | * { не подгруз* * @Website } *
        | * { не работ* * @WebBrowser } *
        | * { не работ* * @Website } *
        | * { не работа* * @WebBrowser } *
        | * { не работа* * @Website } *
        | * { нифига * не откры* * @WebBrowser } *
        | * { нифига * не откры* * @Website } *
        | * { нифига * не работа* * @WebBrowser } *
        | * { нифига * не работа* * @Website } *
        | * { нихера * не откры* * @WebBrowser } *
        | * { нихера * не откры* * @Website } *
        | * { нихера * не работа* * @WebBrowser } *
        | * { нихера * не работа* * @Website } *
        | * { нихрена * не откры* * @WebBrowser } *
        | * { нихрена * не откры* * @Website } *
        | * { нихрена * не работа* * @WebBrowser } *
        | * { нихрена * не работа* * @Website } *
        | * { ничего * не откры* * @WebBrowser } *
        | * { ничего * не откры* * @Website } *
        | * { ничего * не работа* * @WebBrowser } *
        | * { ничего * не работа* * @Website } *
        | * { откры* * $color * @WebBrowser } *
        | * { откры* * $color * @Website } * 
        | * { ошибк* * @Website }
        | * { ошибк* откр* * (@WebBrowser/@Website)} *)

    $tvEquipmentProblem = (* { не работ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не реагир* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идентифиц* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не запуск* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идет * @TVEquipment * [@Television/@TVSet] } *
        | *{ медленно * работа* * @TVEquipment * [@Television/@TVSet] } *
        | *{ @Wrong * работа* * @TVEquipment * [@Television/@TVSet] } *
        | *{ проблем* * @TVEquipment * [@Television/@TVSet] } *
        | *{ жалоб* * @TVEquipment * [@Television/@TVSet] } *
        | *{ ошибк* * @TVEquipment * [@Television/@TVSet] } *
        | *{ неисправ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ настро* * @TVEquipment * [@Television/@TVSet] } *
        | *{ настра* * @TVEquipment * [@Television/@TVSet] } *
        | *{ настрой* * @TVEquipment * [@Television/@TVSet] } *
        | *{ (не @Successful) * настрой* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идет * настрой* * @TVEquipment * [@Television/@TVSet] } *
        | *{ (не @Successful) * настроит* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идет * настроит* * @TVEquipment * [@Television/@TVSet] } *
        | *{ (не @Successful) * подключ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идет * подключ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ (не @Successful) * включ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идет * включ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ (не @Successful) * запус* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не идет * запус* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не исправ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ провер* * @Cable * @TVEquipment * [@Television/@TVSet] } *
        | *{ провер* * подключен* * @TVEquipment * [@Television/@TVSet] } *
        | *{ нет сигнала * неисправн* * @TVEquipment } *
        | *{ ошибк* * установ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ ошибк* * подключен* * @TVEquipment * [@Television/@TVSet] } *
        | *{ ошибк* * настро* * @TVEquipment * [@Television/@TVSet] } *
        | *{ ошибк* * загруз* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не подключается * (@WiFi/@Internet) * @TVEquipment } *
        | *{ не подключается * @TVEquipment * [@Television/@TVSet] } *
        | *{ не работ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ висн* * @TVEquipment * [@Television/@TVSet] } *
        | *{ висит * @TVEquipment * [@Television/@TVSet] } *
        | *{ завис* * @TVEquipment * [@Television/@TVSet] } *
        | *{ барах* * @TVEquipment * [@Television/@TVSet] } *
        | *{ глюч* * @TVEquipment * [@Television/@TVSet] } *
        | *{ не включ* * @TVEquipment * [@Television/@TVSet] } * 
        | *{ перестал* * работ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * реагир* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * идентифиц* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * запуск* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * идти * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * верно * работа* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * настр* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * подключ* * @TVEquipment * [@Television/@TVSet] } *
        | *{ перестал* * включ* * @TVEquipment * [@Television/@TVSet] } *  
        | *{ не найден* * @TVEquipment * [@Television/@TVSet] } * 
        | *{ слома* * @TVEquipment * [@Television/@TVSet] } * 
        | *{ полома* * @TVEquipment * [@Television/@TVSet] } *
        | *{ поломк* * @TVEquipment * [@Television/@TVSet] } * 
        | *{ подключить * смарт (@Television/@TVSet) } *  )

    $tvServiceProblem = (* { (@Bad/$bad) * (тв/тиви/тэвэ/теве) (сервис*/приложен*)} *
        | * { не совпада* * @TVServices } *
        | * { не запуска* * @TVServices } *
        | * { неисправ* * @TVServices } *
        | * { не исправ* * @TVServices } *
        | * { не работа* * @TVServices } *
        | * { не отвеча* * @TVServices } *
        | * { (@Bad/$bad) * @TVServices } *
        | * { (недоступ*/не доступ*) * @TVServices } *
        | * { парол* * @TVServices } *
        | * { заблокиров* * @TVServices } *
        | * { перестал* * вход* * @TVServices } *
        | * { перестал* * заход* * @TVServices } *
        | * { перестал* * подключ* * @TVServices } *
        | * { не [@Successful] * войти * @TVServices } *
        | * { не [@Successful] * зайти * @TVServices } *
        | * { не [@Successful] * подключить * @TVServices } *
        | * { не доступ* * @TVServices } *
        | * { проблем* * @TVServices } *
        | * { ошибк* * @TVServices } *
        | * { жалоб* * @TVServices } *
        | * { неисправност* * @TVServices } *
        | * { неполадк* * @TVServices } *
        | * { не работа* * @YouTube * @TVSet } *
        | * @ParentalControl * )

    $phoneProblem = ( * { (@Bad/$bad) * работ* * номер* * @Telephone } *
        | * { (@Bad/$bad) * работ* * @SynonymsForCall * @Telephone } *
        | * { (@Bad/$bad) * работ* } * { @Telephone * [@Equipment] } *
        | * { (@Bad/$bad) * работ* * вызов* } *
        | * { домашн* * @Telephone } *
        | * { стационарн* * @Telephone } *
        | * { городск* * @Telephone } *
        | * { (еле/едва) работа* } * { @Telephone * [@Equipment] } *
        | * { лаг * @Telephone * [@Equipment] } *
        | * { лаги * @Telephone * [@Equipment] } *
        | * { лагать * @Telephone * [@Equipment] } *
        | * { подлагива* * @Telephone * [@Equipment] } *
        | * { лагает * @Telephone * [@Equipment] } *
        | * { (не исправ*/неисправ*) * @Telephone * [@Equipment] } *
        | * { не исправ* * трубк* * @Telephone } *
        | * { неисправ* * трубк* * @Telephone } *
        | * { не определ* * (номер*/@SynonymsForCall) * @Telephone } *
        | * { обрыв* * номер* * @Telephone } *
        | * { сбрасыва* * номер* * @Telephone } *
        | * { сброс* * номер* * @Telephone } *
        | * { дроп* * номер* * @Telephone } *
        | * { обрыв* * @SynonymsForCall * @Telephone } *
        | * { сбрасыва* * @SynonymsForCall * @Telephone } *
        | * { сброс* * @SynonymsForCall * @Telephone } *
        | * { дроп* * @SynonymsForCall * @Telephone } *
        | * { оборв* * @SynonymsForCall * @Telephone } *
        | * { не работ* * @Telephone * [@Equipment] } *
        | * { не работ* * трубк* * @Telephone * [@Equipment] } *
        | * { нерабоч* * @Telephone * [@Equipment] } *
        | * { нерабоч* * трубк* * @Telephone * [@Equipment] } *
        | * { (недовол*/не довол*) * @Telephone * [@Equipment] } *
        | * { (оборва*/обрыв*) * @Telephone * [@Equipment] } *
        | * { (отключен*/отключился/отключилась) * @Telephone * [@Equipment] } *
        | * { (отруби*/обруби*) * @Telephone * [@Equipment] } *
        | * { (отсутствует /отсутстви*) * @Telephone * [@Equipment] } *
        | * { ошибк* * @SynonymsForCall * @Telephone } *
        | * { пауз* * @SynonymsForCall * @Telephone } *
        | * { перебо* * @SynonymsForCall * @Telephone } *
        | * { подвис* * @SynonymsForCall * @Telephone } *
        | * { подлаг* * @SynonymsForCall * @Telephone } *
        | * { ошибк* * вызов* * @Telephone } *
        | * { пауз* * вызов* * @Telephone } *
        | * { перебо* * вызов* * @Telephone } *
        | * { подвис* * вызов* * @Telephone } *
        | * { подлаг* * вызов* * @Telephone } *
        | * { полома* * @SynonymsForCall * @Telephone } *
        | * { поломк* * @SynonymsForCall * @Telephone } *
        | * { полома* * [трубк*] * @Telephone } *
        | * { поломк* * [трубк*] * @Telephone } *
        | * { сломал* * [трубк*] * @Telephone } *
        | * { сломан* * [трубк*] * @Telephone } *
        | * { починят* * @SynonymsForCall * @Telephone } *
        | * { починит* * [трубк*] * @Telephone } *
        | * { починят* * [трубк*] * @Telephone } *
        | * { полома* * вызов* * @Telephone } *
        | * { сломал* * @SynonymsForCall * @Telephone } *
        | * { починит* * @SynonymsForCall * @Telephone } *
        | * { (сбои/сбой) * @Telephone } *
        | * { прерыва* * @SynonymsForCall * @Telephone } *
        | * { прерва* * @SynonymsForCall * @Telephone } *
        | * { (ухудшени*/ухудшил*) * @Telephone } *
        | * { чинит* * @SynonymsForCall * @Telephone } *
        | * { чинит* * [трубк*] * @Telephone } *
        | * { ремонт* * @SynonymsForCall * @Telephone } *
        | * { ремонт* * [трубк*] * @Telephone } *
        | * { барахл* * @Telephone } *
        | * { барахл* * [трубк*] * @Telephone } *
        | * { бед* * @Telephone } *
        | * { безобрази* * @Telephone } *
        | * { вопрос* * домашн* * @Telephone } *
        | * { вопрос* * стационарн* * @Telephone } *
        | * { вопрос* * городск* * @Telephone } *
        | * { глючит * @Telephone } *
        | * { глючит * [трубк*] * @Telephone } *
        | * { жалоб* * @Telephone } *
        | * { задержк* * @Telephone } *
        | * { молча* * @Telephone } *
        | * { молчи* * @Telephone } *
        | * { испорчен* * @Telephone } *
        | * { не заработа* * @Telephone } *
        | * { не проход* * @SynonymsForCall * [@Telephone] } *
        | * { не слышн* * @SynonymsForCall * @Telephone } *
        | * { неполадк* * @Telephone } *
        | * { отремонтир* * @Telephone } *
        | * { перестал* * работ* * номер* * @Telephone } *
        | * { перестал* * работ* * @SynonymsForCall * @Telephone } *
        | * { перестал* * работ* * @Telephone } *
        | * { помех* * телефон* * трубк* } *
        | * { помех* * телефон* * @SynonymsForCall } *
        | * { претензи* * @Telephone } *
        | * { проблем* * @Telephone } *
        | * { ряб* * телефон* * трубк* } *
        | * { ряб* * телефон* * @Telephone } *
        | * { ряб* * телефон* * @SynonymsForCall } *
        | * { сложност* * @Telephone } *
        | * { треск* * телефон* * трубк* } *
        | * { треск* * @Telephone } *
        | * { треск* * @SynonymsForCall } *
        | * { шум* * телефон* * трубк* } *
        | * { шум* * @Telephone } *
        | * { шум* * телефон* * @SynonymsForCall } *
        | * { не работа* * домашн* @Telephone } * 
        | * { не работа* * стационар* @Telephone } * 
        | * { не работа* * городск* @Telephone } * 
        | {@Telephone не восстановил*}
        | {@Telephone не появил*} )

    $setupRouter = ( * { не настроен* * @InternetEquipment } *
        | * { не настрои* * @InternetEquipment } *
        | * { не настраива* * @InternetEquipment } *
        | * { не настроен* * @WiFi @Equipment } *
        | * { не настрои* * @WiFi @Equipment } *
        | * { не настраива* * @WiFi @Equipment } *
        | * { ошибк* * установк* * @InternetEquipment } *
        | * { ошибк* * подключени* * @InternetEquipment } *
        | * { ошибк* * настройк* * @InternetEquipment } *
        | * { ошибк* * загрузк* * @InternetEquipment } *
        | * { ошибк* * установк* * @WiFi @Equipment } *
        | * { ошибк* * подключени* * @WiFi @Equipment } *
        | * { ошибк* * настройк* * @WiFi @Equipment } *
        | * { ошибк* * загрузк* * @WiFi @Equipment } *
        | * { проблем* * установк* * @InternetEquipment } *
        | * { [ @Operator $weight<+0.3>] * проблем* * подключени* * @InternetEquipment } *
        | * { проблем* * настройк* * @InternetEquipment } *
        | * { проблем* * загрузк* * @InternetEquipment } *
        | * { проблем* * установк* * @WiFi @Equipment } *
        | * { [ @Operator $weight<+0.3>] * проблем* * подключени* * @WiFi @Equipment } *
        | * { проблем* * настройк* * @WiFi @Equipment } *
        | * { проблем* * загрузк* * @WiFi @Equipment } *
        | * { *настроить * @InternetEquipment } *
        | * { переподключить * @InternetEquipment } *
        | * { *настроить * @WiFi @Equipment } *
        | * { переподключить * @WiFi @Equipment } *
        | * { сбрасыва* * настройк* * @InternetEquipment } *
        | * { сброс* * настройк* * @InternetEquipment } *
        | * { дроп* * настройк* * @InternetEquipment } *
        | * { сбрасыва* * настройк* * @WiFi @Equipment } *
        | * { сброс* * настройк* * @WiFi @Equipment } *
        | * { дроп* * настройк* * @WiFi @Equipment } *
        | * { купил* * нов* * @InternetEquipment } *
        | * { не включ* * @WiFi * @InternetEquipment } *
        | * { не включ* * сесси* * @InternetEquipment } *
        | * { не включ* * сет* * @InternetEquipment } *
        | * { не включ* * @WiFi * @Equipment } *
        | * { не включ* * сесси* * @Equipment } *
        | * { не включ* * сет* * @Equipment } *
        | * { не подключ* * @WiFi * @InternetEquipment } *
        | * { не подключ* * сесси* * @InternetEquipment } *
        | * { не подключ* * сет* * @InternetEquipment } *
        | * { не подключ* * @WiFi * @Equipment } *
        | * { не подключ* * сесси* * @Equipment } *
        | * { не подключ* * сет* * @Equipment } *
        | * { параметр* * @InternetEquipment } *
        | * { параметр* * @WiFi @Equipment } *
        | * { перестал * работать * @InternetEquipment } *
        | * { перестал * работать * @WiFi @Equipment } *
        | * { подключен* * нов* * @InternetEquipment } *
        | * { подключен* * друг* * @InternetEquipment } *
        | * { подключен* * нов* * @WiFi @Equipment } *
        | * { подключен* * друг* * @WiFi @Equipment } *
        | * { $regexp<подключ(ить|иться|ение|ения)> * @Internet } * { нов* * @InternetEquipment } *
        | * { $regexp<подключ(ить|иться|ение|ения)> * @Internet } * { друг* * @InternetEquipment } *
        | * { $regexp<подключ(ить|иться|ение|ения)> * @Internet } * { нов* * @WiFi @Equipment } *
        | * { $regexp<подключ(ить|иться|ение|ения)> * @Internet } * { друг* * @WiFi @Equipment } *
        | * { (поменял/поменяла/поменяли) * @InternetEquipment } *
        | * { (поменял/поменяла/поменяли) * @WiFi @Equipment } *
        | * { сбил* * настройк* * @InternetEquipment } *
        | * { сбил* * настройк* * @WiFi @Equipment } *
        | * { установ* * нов* * @InternetEquipment } *
        | * { установ* * друг* * @InternetEquipment } *
        | * { установ* * нов* * @WiFi @Equipment } *
        | * { установ* * друг* * @WiFi @Equipment } *
        | * { (не @Successful) * настроен* * @InternetEquipment } *
        | * { (не @Successful) * настрои* * @InternetEquipment } *
        | * { (не @Successful) * настраива* * @InternetEquipment } *
        | * { (не @Successful) * настрой* * @InternetEquipment } *
        | * { (не @Successful) * настроен* * @WiFi } *
        | * { (не @Successful) * настрои* * @WiFi } *
        | * { (не @Successful) * настраива* * @WiFi } *
        | * { (не @Successful) * настрой* * @WiFi } *
        | * { (не @Successful) * измен* парол* * @InternetEquipment } *
        | * { (не @Successful) * измен* парол* * @WiFi } *
        | * { настроен* * @InternetEquipment } *
        | * { настроен* * @WiFi @Equipment } *
        | * { [@Operator $weight<+0.3>] * настрои* * @InternetEquipment } *
        | * { [@Operator $weight<+0.3>] * настрои* * @WiFi @Equipment } *
        | * { настраива* * @InternetEquipment } *
        | * { настраива* * @WiFi @Equipment } *
        | * { [@Operator $weight<+0.3>] * настрой* * @InternetEquipment } *
        | * { [@Operator $weight<+0.3>] * настрой* * @WiFi @Equipment } *
        | * { (заменил/заменили/заменили) * @InternetEquipment } *
        | * { (заменил/заменили/заменили) * @WiFi @Equipment } *
        | * { установ* * @InternetEquipment } *
        | * { установ* * @WiFi @Equipment } *
        | * { @Operator * настрои* * @InternetEquipment } *
        | * { @Operator * настрои* * @WiFi @Equipment } *
        | * { @Operator * установ* * @InternetEquipment } *
        | * { @Operator * установ* * @WiFi @Equipment } *
        | * { @Personal * настрои* * @InternetEquipment } *
        | * { @Personal * настрои* * @WiFi @Equipment } *
        | * { @Personal * установ* * @InternetEquipment } *
        | * { @Personal * установ* * @WiFi @Equipment } * 
        | * { @Credentials * @InternetEquipment } *
        | * { @Credentials * @WiFi @Equipment } *
        | * { @Give * @Credentials * ([@My] * @InternetEquipment) } *
        | * { @Give * @Credentials * ([@My] * @WiFi @Equipment) } *
        | * { @Change * @Credentials * @WiFi [@Equipment] } *
        | * { @Change * @Credentials * @InternetEquipment } *
        | * { настроен* * подключен* * @InternetEquipment } *
        | * { настроен* * подключен* * @WiFi @Equipment } *
        | * { настрои* * подключен* * @InternetEquipment } *
        | * { настрои* * подключен* * @WiFi @Equipment } *
        | * { настраива* * подключен* * @InternetEquipment } *
        | * { настраива* * подключен* * @WiFi @Equipment } *
        | * { настрой* * подключен* * @InternetEquipment } *
        | * { настрой* * подключен* * @WiFi @Equipment } *
        | * { настроен* * соедин* * @InternetEquipment } *
        | * { настроен* * соедин* * @WiFi @Equipment } *
        | * { настрои* * соедин* * @InternetEquipment } *
        | * { настрои* * соедин* * @WiFi @Equipment } *
        | * { настраива* * соедин* * @InternetEquipment } *
        | * { настраива* * соедин* * @WiFi @Equipment } *
        | * { настрой* * соедин* * @InternetEquipment } *
        | * { настрой* * соедин* * @WiFi @Equipment } * 
        | * { *подключ* * @WiFi * (к/на) друг* сет* } *
        | * { *подключ* * @WiFi * (к/на) друг* частот* } *
        | * { @Change * @WiFi * (к/на) друг* сет* } *
        | * { @Change * @WiFi * (к/на) друг* частот* } *
        | * { (восстанав*/восстанов*) * мак * @InternetEquipment } *
        | * { (восстанав*/восстанов*) * мак * @WiFi @Equipment } *
        | * { (@Change/@ChangePast) * мак * @InternetEquipment } *
        | * { (@Change/@ChangePast) * мак * @WiFi @Equipment } *
        | * { @IPaddress * @InternetEquipment } *
        | * { не включ* * (@WiFi/сесси*/сет*) * @Device } *
        | * { не подключ* * (сесси*/сет*) * @Device } *
        | * { (не включ*/не подключ*) * @WiFi } *
        | * { (не @Successful) * включ* * @WiFi } *
        | * { (не @Successful) * подключ* * @WiFi } * [ пароль $weight<-1>] )

    $serviceRequestInfo = ( * { @Change * @Personal } *
        | * { визит* * (@Personal/специалист*) } *
        | * { приход* * (@Personal/специалист*) } *
        | * { время * @Personal } *
        | * { встреч* * @Personal } *
        | * { выезд* * (@Personal/специалист*) } *
        | * { заказ* * @Personal } *
        | * { запрос* * @Personal } *
        | * { @Request * @Personal } *
        | * { (где/когда) * @Personal } *
        | * { (до сих пор) * (нет/нету) * @Personal } *
        | * { (до сих пор) * (нет/нету) * специалист* } *
        | * [когда/во сколько/@SlowAdv] * { ждем * @Personal } *
        | * [когда/во сколько/@SlowAdv] * { ждать * @Personal } *
        | * [когда/во сколько/@SlowAdv] * { ждал* * @Personal } *
        | * [когда/во сколько/@SlowAdv] * { ожида* * @Personal } *
        | * { закрыт* * заказ* * @Personal } *
        | * { закрыт* * запрос* * @Personal } *
        | * { закрыв* * заказ* * @Personal } *
        | * { закрыв* * запрос* * @Personal } *
        | * { (нет/нету) * @Personal } *
        | * { отмен* * @Personal } *
        | * { перенес* * @Personal } *
        | * { перенос* * @Personal } *
        | * { приезд* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { подойд* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { подойт* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { подъед* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { подъеха* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { приезж* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { приех* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { пришел* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { приед* * (@Personal/специалист*) } *
        | * [когда/во сколько] * { прийти * (@Personal/специалист*) } *
        | * { (стоит*/стоим*) * визит* * @Personal } *
        | * { (стоит*/стоим*) * приход* * @Personal } *
        | * { (стоит*/стоим*) * встреч* * @Personal } *
        | * { (стоит*/стоим*) * выезд* * @Personal } *
        | * { (стоит*/стоим*) * заказ* * @Personal } *
        | * { (стоит*/стоим*) * запрос* * @Personal } *
        | * { (стоит*/стоим*) * @Request * @Personal } *
        | * { (стоит*/стоим*) * визит* * специалист* } *
        | * { (стоит*/стоим*) * приход* * специалист* } *
        | * { (стоит*/стоим*) * встреч* * специалист* } *
        | * { (стоит*/стоим*) * выезд* * специалист* } *
        | * { (стоит*/стоим*) * заказ* * специалист* } *
        | * { (стоит*/стоим*) * запрос* * специалист* } *
        | * { (стоит*/стоим*) * @Request * специалист* } *
        | * { @duckling.date * будет * @Personal } *
        | * { @duckling.date * придет * (@Personal/специалист*) } *
        | * { оcтав* * @Request * (@Personal/специалист*) } *
        | * { отмен* * визит* * (@Personal/специалист*) } *
        | * { отмен* * приход* * (@Personal/специалист*) } *
        | * { отмен* * встреч* * (@Personal/специалист*) } *
        | * { отмен* * выезд* * (@Personal/специалист*) } *
        | * { отмен* * заказ* * @Personal } *
        | * { отмен* * запрос* * @Personal } *
        | * { отмен* * @Request * [@Personal/подключен*] } *
        | * { отмен* * вызов* * [@Personal] } *
        | * { отмен* * подключ* * @AllServices} *
        | * { отказ* * от подключ* * @AllServices} *
        | * { @Change * визит* * (@Personal/специалист*) } *
        | * { @Change * приход* * (@Personal/специалист*) } *
        | * { @Change * встреч* * (@Personal/специалист*) } *
        | * { @Change * выезд* * (@Personal/специалист*) } *
        | * { @Change * заказ* * @Personal } *
        | * { @Change * запрос* * @Personal } *
        | * { @Change * @Request * [@Personal] } *
        | * { @Change * вызов* * @Personal } *
        | * { @Change * время * (@Personal/специалист*) } *
        | * { @Change * ~дата * (@Personal/специалист*) } *
        | * { @Change * ~день * (@Personal/специалист*) } *
        | * { *блокир* * визит* * (@Personal/специалист*) } *
        | * { *блокир* * приход* * (@Personal/специалист*) } *
        | * { *блокир* * встреч* * (@Personal/специалист*) } *
        | * { *блокир* * выезд* * (@Personal/специалист*)} *
        | * { *блокир* * заказ* * @Personal } *
        | * { *блокир* * запрос* * @Personal } *
        | * { *блокир* * @Request * @Personal } *
        | * { врем* * визит* * (@Personal/специалист*) } *
        | * { врем* * приход* * (@Personal/специалист*) } *
        | * { врем* * встреч* * (@Personal/специалист*) } *
        | * { врем* * выезд* * (@Personal/специалист*) } *
        | * { врем* * заказ* * @Personal } *
        | * { врем* * запрос* * @Personal } *
        | * { врем* * @Request * @Personal } *
        | * { врем* * вызов* * @Personal } *
        | * { [не] выполн* * визит* * (@Personal/специалист*) } *
        | * { [не] выполн* * приход* * (@Personal/специалист*) } *
        | * { [не] выполн* * встреч* * (@Personal/специалист*)} *
        | * { [не] [не] выполн* * выезд* * (@Personal/специалист*) } *
        | * { [не] выполн* * заказ* * @Personal } *
        | * { [не] выполн* * запрос* * @Personal } *
        | * { [не] выполн* * @Request * [@Personal] } *
        | * { [не] выполн* * вызов* * @Personal } *
        | * { задерж* * @Personal } *
        | * { заказ* * визит* * (@Personal/специалист*) } *
        | * { заказ* * приход* * (@Personal/специалист*) } *
        | * { заказ* * время * @Personal } *
        | * { заказ* * встреч* * (@Personal/специалист*) } *
        | * { заказ* * выезд* * (@Personal/специалист*) } *
        | * { @Request * визит* * (@Personal/специалист*) } *
        | * { @Request * приход* * (@Personal/специалист*) } *
        | * { @Request * время * @Personal } *
        | * { @Request * встреч* * (@Personal/специалист*) } *
        | * { @Request * выезд* * (@Personal/специалист*) } *
        | * { давал* * @Request * @AllServices } *
        | * { делал* * @Request * @AllServices } *
        | * { исполн* * заказ* * @Personal } *
        | * { исполн* * запрос* * @Personal } *
        | * { назнач* * визит* * (@Personal/специалист*) } *
        | * { назнач* * приход* * (@Personal/специалист*) } *
        | * { назнач* * встреч* * (@Personal/специалист*) } *
        | * { назнач* * выезд* * (@Personal/специалист*) } *
        | * { назнач* * заказ* * @Personal } *
        | * { назнач* * запрос* * @Personal } *
        | * { назнач* * @Request * @Personal } *
        | * { назнач* * вызов* * (@Personal/специалист*) } *
        | * { не (@Need/@Want) * (@Personal/специалист*) } *
        | * { не (был/было) * (@Personal/специалист*) } *
        | * { не подойд* * (@Personal/специалист*) } *
        | * { не подош* * (@Personal/специалист*) } *
        | * { не подъед* * (@Personal/специалист*) } *
        | * { не подъеха* * (@Personal/специалист*) } *
        | * { не (появлялся/появился) * (@Personal/специалист*) } *
        | * { не приезж* * (@Personal/специалист*) } *
        | * { не приех* * (@Personal/специалист*) } *
        | * { не пришел* * (@Personal/специалист*) } *
        | * { не приед* * (@Personal/специалист*) } *
        | * { не прийти * (@Personal/специалист*) } *
        | * { не приход* * (@Personal/специалист*) } *
        | * { не вызывал* * (@Personal/специалист*) } *
        | * { не отправил* * (@Personal/специалист*) } *
        | * { отзови* * визит* * (@Personal/специалист*) } *
        | * { отзови* * приход* * (@Personal/специалист*) } *
        | * { отзови* * встреч* * (@Personal/специалист*) } *
        | * { отзови* * выезд* * (@Personal/специалист*) } *
        | * { отзови* * заказ* * @Personal } *
        | * { отзови* * запрос* * @Personal } *
        | * { отзови* * @Request * @Personal } *
        | * { отзови* * вызов* * @Personal } *
        | * { отзыв* * визит* * (@Personal/специалист*) } *
        | * { отзыв* * приход* * (@Personal/специалист*) } *
        | * { отзыв* * встреч* * (@Personal/специалист*) } *
        | * { отзыв* * выезд* * (@Personal/специалист*) } *
        | * { отзыв* * заказ* * @Personal } *
        | * { отзыв* * запрос* * @Personal } *
        | * { отзыв* * @Request * @Personal } *
        | * { отзыв* * вызов* * @Personal } *
        | * { открыт* * визит* * (@Personal/специалист*) } *
        | * { открыт* * приход* * (@Personal/специалист*) } *
        | * { открыт* * встреч* * (@Personal/специалист*) } *
        | * { открыт* * выезд* * (@Personal/специалист*) } *
        | * { открыт* * заказ* * @Personal } *
        | * { открыт* * запрос* * @Personal } *
        | * { открыт* * @Request * @Personal } *
        | * { открыт* * вызов* * @Personal } *
        | * { отозв* * визит* * (@Personal/специалист*) } *
        | * { отозв* * приход* * (@Personal/специалист*) } *
        | * { отозв* * встреч* * (@Personal/специалист*) } *
        | * { отозв* * выезд* * (@Personal/специалист*) } *
        | * { отозв* * заказ* * @Personal } *
        | * { отозв* * запрос* * @Personal } *
        | * { отозв* * @Request * @Personal } *
        | * { отозв* * вызов* * @Personal } *
        | * { отказ* * визит* * (@Personal/специалист*) } *
        | * { отказ* * приход* * (@Personal/специалист*) } *
        | * { отказ* * встреч* * (@Personal/специалист*) } *
        | * { отказ* * выезд* * (@Personal/специалист*) } *
        | * { отказ* * заказ* * @Personal } *
        | * { отказ* * запрос* * @Personal } *
        | * { отказ* * @Request * @Personal } *
        | * { отказ* * вызов* * @Personal } *
        | * { отказ* * @Request * подключен* } *
        | * { отбой * визит* * (@Personal/специалист*) } *
        | * { отбой * приход* * (@Personal/специалист*) } *
        | * { отбой * встреч* * (@Personal/специалист*) } *
        | * { отбой * выезд* * (@Personal/специалист*) } *
        | * { отбой * заказ* * @Personal } *
        | * { отбой * запрос* * @Personal } *
        | * { отбой * @Request * @Personal } *
        | * { отбой * вызов* * @Personal } *
        | * { отбой * вызов* } * { [@AllServices/@TVSet] * работа* } *
        | * { отбой * @Request * подключен* } *
        | * { провер* * @Request } *
        | * { сними* * @Request } *
        | * { убери* * @Request } *
        | * { удали* * @Request } *
        | * { убра* * @Request } *
        | * { перенес* * визит* * (@Personal/специалист*) } *
        | * { перенес* * приход* * (@Personal/специалист*) } *
        | * { перенес* * встреч* * (@Personal/специалист*) } *
        | * { перенес* * выезд* * (@Personal/специалист*) } *
        | * { перенес* * заказ* * @Personal } *
        | * { перенес* * запрос* * @Personal } *
        | * { перенес* * @Request * @Personal } *
        | * { перенес* * вызов* * @Personal } *
        | * { перенос* * визит* * (@Personal/специалист*) } *
        | * { перенос* * приход* * (@Personal/специалист*) } *
        | * { перенос* * встреч* * (@Personal/специалист*) } *
        | * { перенос* * выезд* * (@Personal/специалист*) } *
        | * { перенос* * заказ* * @Personal } *
        | * { перенос* * запрос* * @Personal } *
        | * { перенос* * @Request * @Personal } *
        | * { перенос* * вызов* * @Personal } *
        | * { провер* * визит* * (@Personal/специалист*) } *
        | * { провер* * приход* * (@Personal/специалист*) } *
        | * { провер* * встреч* * (@Personal/специалист*) } *
        | * { провер* * выезд* * (@Personal/специалист*) } *
        | * { провер* * заказ* * @Personal } *
        | * { провер* * запрос* * @Personal } *
        | * { провер* * @Request * @Personal } *
        | * { провер* * вызов* * @Personal } *
        | * { сегодня * будет * @Personal } *
        | * { сегодня * придет * @Personal } *
        | * { сними* * визит* * (@Personal/специалист*) } *
        | * { сними* * приход* * (@Personal/специалист*) } *
        | * { сними* * встреч* * (@Personal/специалист*) } *
        | * { сними* * выезд* * (@Personal/специалист*) } *
        | * { сними* * заказ* * @Personal } *
        | * { сними* * запрос* * @Personal } *
        | * { сними* * вызов* * @Personal } *
        | * { созда* * визит* * (@Personal/специалист*) } *
        | * { созда* * приход* * (@Personal/специалист*) } *
        | * { созда* * встреч* * (@Personal/специалист*) } *
        | * { созда* * выезд* * (@Personal/специалист*) } *
        | * { созда* * заказ* * @Personal } *
        | * { созда* * запрос* * @Personal } *
        | * { созда* * @Request * @Personal } *
        | * { созда* * вызов* * @Personal } *
        | * { убери* * визит* * (@Personal/специалист*) } *
        | * { убери* * приход* * (@Personal/специалист*) } *
        | * { убери* * встреч* * (@Personal/специалист*) } *
        | * { убери* * выезд* * (@Personal/специалист*) } *
        | * { убери* * заказ* * @Personal } *
        | * { убери* * запрос* * @Personal } *
        | * { убери* * вызов* * @Personal } *
        | * { убрать * визит* * (@Personal/специалист*) } *
        | * { убрать * приход* * (@Personal/специалист*) } *
        | * { убрать * встреч* * (@Personal/специалист*) } *
        | * { убрать * выезд* * (@Personal/специалист*) } *
        | * { убрать * заказ* * @Personal } *
        | * { убрать * запрос* * @Personal } *
        | * { убрать * @Request * @Personal } *
        | * { убрать * вызов* * @Personal } *
        | * { статус* * визит* * (@Personal/специалист*) } *
        | * { статус* * приход* * (@Personal/специалист*) } *
        | * { статус* * встреч* * (@Personal/специалист*) } *
        | * { статус* * выезд* * (@Personal/специалист*) } *
        | * { статус* * заказ* * @Personal } *
        | * { статус* * запрос* * @Personal } *
        | * { статус* * @Request * @Personal } *
        | * { статус* * вызов* * @Personal } *
        | * { @Know * визит* * (@Personal/специалист*) } *
        | * { @Know * приход* * (@Personal/специалист*) } *
        | * { @Know * встреч* * (@Personal/специалист*) } *
        | * { @Know * выезд* * (@Personal/специалист*) } *
        | * { @Know * заказ* * @Personal } *
        | * { @Know * запрос* * @Personal } *
        | * { @Know * @Request * @Personal } *
        | * { @Know * вызов* * @Personal } *
        | * { уточнить * визит* * (@Personal/специалист*) } *
        | * { уточнить * приход* * (@Personal/специалист*) } *
        | * { уточнить * встреч* * (@Personal/специалист*) } *
        | * { уточнить * выезд* * (@Personal/специалист*) } *
        | * { уточнить * заказ* * @Personal } *
        | * { уточнить * запрос* * @Personal } *
        | * { уточнить * @Request * @Personal } *
        | * { уточнить * вызов* * @Personal } *
        | * { шаг* * визит* * (@Personal/специалист*) } *
        | * { шаг* * приход* * (@Personal/специалист*)} *
        | * { шаг* * встреч* * (@Personal/специалист*) } *
        | * { шаг* * выезд* * (@Personal/специалист*) } *
        | * { шаг* * заказ* * @Personal } *
        | * { шаг* * запрос* * @Personal } *
        | * { шаг* * @Request * @Personal } *
        | * { шаг* * вызов* * @Personal } *
        | * { @Request * восстанов* * @AllServices } *
        | * { (просрок*/просроч*) * @Request } * )

    $restoreWiFipassword = ( * (ключ/код) * @InternetEquipment *
        | * { (*сылать/отправ*/*слать) * (ключ/код) * @InternetEquipment } *
        | * { (*сылать/отправ*/*слать) * данные * @InternetEquipment } *
        | * { (*сылать/отправ*/*слать) * пароль * @InternetEquipment } *
        | * { (восстанавлива*/восстановит*) * (ключ/код) * @InternetEquipment } *
        | * { (восстанавлива*/восстановит*) * данные * @InternetEquipment } *
        | * { (восстанавлива*/восстановит*) * пароль * @InternetEquipment } *
        | * { (вспомни*/вспомин*) * (ключ/код) * @InternetEquipment } *
        | * { (вспомни*/вспомин*) * данные * @InternetEquipment } *
        | * { (вспомни*/вспомин*) * пароль * @InternetEquipment } *
        | * { (выдай/выдайте/выдать) * (ключ/код) * @InternetEquipment } *
        | * { (выдай/выдайте/выдать) * данные * @InternetEquipment } *
        | * { (выдай/выдайте/выдать) * пароль * @InternetEquipment } *
        | * { (выслать/вышли*/высыла*) * (ключ/код) * @InternetEquipment } *
        | * { (выслать/вышли*/высыла*) * данные * @InternetEquipment } *
        | * { (выслать/вышли*/высыла*) * пароль * @InternetEquipment } *
        | * { (дай/дайте/дать) * (ключ/код) * @InternetEquipment } *
        | * { (дай/дайте/дать) * данные * @InternetEquipment } *
        | * { (дай/дайте/дать) * пароль * @InternetEquipment } *
        | * { (забыл*/забыть/забывать) * (ключ/код) * @InternetEquipment } *
        | * { (забыл*/забыть/забывать) * данные * @InternetEquipment } *
        | * { (забыл*/забыть/забывать) * данные * @InternetEquipment } *
        | * { (забыл*/забыть/забывать) * пароль * @InternetEquipment } *
        | * { (назов*/назван*/назыв*) * (ключ/код) * @InternetEquipment } *
        | * { (назов*/назван*/назыв*) * данные * @InternetEquipment } *
        | * { (назов*/назван*/назыв*) * пароль * @InternetEquipment } *
        | * { (найти/находить) * (ключ/код) * @InternetEquipment } *
        | * { (найти/находить) * данные * @InternetEquipment } *
        | * { (найти/находить) * пароль * @InternetEquipment } *
        | * { (направь*/направит*) * (ключ/код) * @InternetEquipment } *
        | * { (направь*/направит*) * данные * @InternetEquipment } *
        | * { (направь*/направит*) * пароль * @InternetEquipment } *
        | * { (послать/пошли*/посыла*) * (ключ/код) * @InternetEquipment } *
        | * { (послать/пошли*/посыла*) * данные * @InternetEquipment } *
        | * { (послать/пошли*/посыла*) * пароль * @InternetEquipment } *
        | * { (прислать/пришли*) * (ключ/код) * @InternetEquipment } *
        | * { (прислать/пришли*) * данные * @InternetEquipment } *
        | * { (прислать/пришли*) * пароль * @InternetEquipment } *
        | * { (присылает*/пришли*/шлите/шлёте/передай*) * (ключ/код) * @InternetEquipment } *
        | * { (присылает*/пришли*/шлите/шлёте/передай*) * данные * @InternetEquipment } *
        | * { (присылает*/пришли*/шлите/шлёте/передай*) * пароль * @InternetEquipment } *
        | * { (сбрасыва*/сброс*) * (ключ/код) * @InternetEquipment } *
        | * { (сбрасыва*/сброс*) * данные * @InternetEquipment } *
        | * { (сбрасыва*/сброс*) * пароль * @InternetEquipment } *
        | * { *терял* * (ключ/код) * @InternetEquipment } *
        | * { *терял* * данные * @InternetEquipment } *
        | * { *терял* * пароль * @InternetEquipment } *
        | * { @SMS * (ключ/код) * @InternetEquipment } *
        | * { @SMS * (ключ/код) * беспроводн* (подключени*/сети/сессии) } *
        | * { @SMS * (ключ/код) * @WiFi (подключени*/сети/сессии) } *
        | * { @SMS * данные * @InternetEquipment } *
        | * { @SMS * данные * беспроводн* (подключени*/сети/сессии) } *
        | * { @SMS * данные * @WiFi (подключени*/сети/сессии) } *
        | * { @SMS * пароль * @InternetEquipment } *
        | * { @SMS * пароль * беспроводн* (подключени*/сети/сессии) } *
        | * { @SMS * пароль * @WiFi (подключени*/сети/сессии) } *
        | * { *менил* * данные * @InternetEquipment } *
        | * { *менил* * пароль * @InternetEquipment } *
        | * { скажи* * (ключ/код) * @InternetEquipment } *
        | * { скажи* * данные * @InternetEquipment } *
        | * { скажи* * пароль * @InternetEquipment } *
        | * { сказать * (ключ/код) * @InternetEquipment } *
        | * { сказать * данные * @InternetEquipment } *
        | * { сказать * пароль * @InternetEquipment } *
        | * { @Know * (ключ/код) * @InternetEquipment } *
        | * { @Know * данные * @InternetEquipment } *
        | * { @Know * пароль * @InternetEquipment } *
        | * { @Know * пароль * @WiFi } *
        | * { уточн* * пароль * @WiFi } *
        | * данные * @InternetEquipment *
        | * [@Modal] пароль * @WiFi *
        | * получ* * данные * @InternetEquipment *
        | * получ* * пароль * @WiFi *
        | * [@Modal] пароль * обслуживан* * @WiFi *
        | * { авториз* * @WiFi [@InternetEquipment] } * 
        | * { (не @Successful) * подключ* * (пароль * @WiFi) } *   )

    $tvSeveralChannelsMalfunction = ( * { переста* * работ* * @TVChannelName } *
        | * { переста* * показ* * @TVChannelName } *
        | * { исчез* * @TVChannelName } *
        | * { убрал* * @TVChannelName } *
        | * { убира* * @TVChannelName } *
        | * { не показывает * [@TVChannelSingular] * @TVChannelName } *
        | * { не включается * [@TVChannelSingular] * @TVChannelName } *
        | * { не подключается * @TVChannelName } *
        | * { пропадает * @TVChannelName } *
        | * { пропал * @TVChannelName } *
        | * { не найти * @TVChannelName } *
        | * { не нашл* * @TVChannelName } *
        | * { не нашел* * @TVChannelName } *
        | * { не найден * @TVChannelName } *
        | * { не находит* * @TVChannelName } *
        | * { найти * @TVChannelName } *
        | * { (тех/техническ*) * (сбой/сбои) * @TVChannelName } *
        | * { (нет/нету) * @TVChannelName } *
        | * { не работ* * @TVChannelName } *
        | * { отключает* * [@TVChannelSingular] * @TVChannelName } *
        | * { отключил* * [@TVChannelSingular] * @TVChannelName } *
        | * { переста* * работ* * @TVChannelSingular * номер * @duckling.number } *
        | * { переста* * показ* * @TVChannelSingular * номер * @duckling.number } *
        | * { исчез* * @TVChannelSingular * номер * @duckling.number } *
        | * { убрал* * @TVChannelSingular * номер * @duckling.number } *
        | * { убира* * @TVChannelSingular * номер * @duckling.number } *
        | * { не показывает * @TVChannelSingular * номер * @duckling.number } *
        | * { не включается * @TVChannelSingular * номер * @duckling.number } *
        | * { не подключается * @TVChannelSingular * номер * @duckling.number } *
        | * { пропадает * @TVChannelSingular * номер * @duckling.number } *
        | * { пропал * @TVChannelSingular * номер * @duckling.number } *
        | * { не найти * @TVChannelSingular * номер * @duckling.number } *
        | * { не нашл* * @TVChannelSingular * номер * @duckling.number } *
        | * { не нашел* * @TVChannelSingular * номер * @duckling.number } *
        | * { не найден * @TVChannelSingular * номер * @duckling.number } *
        | * { не находит* * @TVChannelSingular * номер * @duckling.number } *
        | * { найти * @TVChannelSingular * номер * @duckling.number } *
        | * { (тех/техническ*) * (сбой/сбои) * @TVChannelSingular * номер * @duckling.number } *
        | * { (нет/нету) * @TVChannelSingular * номер @duckling.number } *
        | * { не работ* * @TVChannelSingular * номер @duckling.number } *
        | * { отключ* * @TVChannelSingular * номер @duckling.number } *
        | * { переста* * работ* * @duckling.ordinal @TVChannelSingular } *
        | * { переста* * показ* * @duckling.ordinal @TVChannelSingular } *
        | * { исчез* * @duckling.ordinal @TVChannelSingular } *
        | * { убрал* * @duckling.ordinal @TVChannelSingular } *
        | * { убира* * @duckling.ordinal @TVChannelSingular } *
        | * { не показывает * @duckling.ordinal @TVChannelSingular } *
        | * { не работает * @duckling.ordinal @TVChannelSingular } *
        | * { не включается * @duckling.ordinal @TVChannelSingular } *
        | * { не подключается * @duckling.ordinal @TVChannelSingular } *
        | * { пропадает * @duckling.ordinal @TVChannelSingular } *
        | * { пропал * @duckling.ordinal @TVChannelSingular } *
        | * { не найти * @duckling.ordinal @TVChannelSingular } *
        | * { не нашл* * @duckling.ordinal @TVChannelSingular } *
        | * { не нашел* * @duckling.ordinal @TVChannelSingular } *
        | * { не найден * @duckling.ordinal @TVChannelSingular } *
        | * { не находит* * @duckling.ordinal @TVChannelSingular } *
        | * { найти * @duckling.ordinal @TVChannelSingular } *
        | * { (тех/техническ*) * (сбой/сбои) * @duckling.ordinal @TVChannelSingular } *
        | * { (нет/нету) * @duckling.ordinal @TVChannelSingular } *
        | * { отключ* * @duckling.ordinal @TVChannelSingular } *
        | * { переста* * работ* * @TVChannelSingular } *
        | * { переста* * показ* * @TVChannelSingular } *
        | * { исчез* * @TVChannelSingular } *
        | * { убрал* * @TVChannelSingular } *
        | * { убира* * @TVChannelSingular } *
        | * { не показ* * @TVChannelSingular } *
        | * { не работ* * @TVChannelSingular } *
        | * { не включ* * @TVChannelSingular } *
        | * { не подключ* * @TVChannelSingular } *
        | * { пропадает * @TVChannelSingular } *
        | * { пропал * @TVChannelSingular } *
        | * { не найти * @TVChannelSingular } *
        | * { не нашл* * @TVChannelSingular } *
        | * { не нашел* * @TVChannelSingular } *
        | * { не найден * @TVChannelSingular } *
        | * { не находит* * @TVChannelSingular } *
        | * { (@Bad/$bad) показ* * @TVChannelSingular } *
        | * { (@Bad/$bad) работ* * @TVChannelSingular } *
        | * { (@Bad/$bad) включ* * @TVChannelSingular } *
        | * { (@Bad/$bad) показ* * [@TVChannelSingular] * @TVChannelName } *
        | * { (@Bad/$bad) работ* * [@TVChannelSingular] * @TVChannelName } *
        | * { (@Bad/$bad) включ* * [@TVChannelSingular] * @TVChannelName } *
        | * { найти * @TVChannelSingular } *
        | * { (тех/техническ*) * (сбой/сбои) * @TVChannelSingular } *
        | * { (нет/нету) * @TVChannelSingular } *
        | * { не работ* * @TVChannelSingular } *
        | * { отключ* * @TVChannelSingular } *
        | * { отключ* * @TVChannel * (за один рубль) } *
        | * один @TVChannelSingular *
        | * { не работает * @TVChannelSingular * (ключ/о/ю/че/чё/домашний) } *
        | * { не работает * домашн* [(@Telephone/@Internet) $weight<-1>] } * 
        | * { не идут * (частично/часть) * @TVChannelPlural } *
        | * { не идут * несколько * @TVChannelPlural } *
        | * { не идут * некотор* * @TVChannelPlural } *
        | * { не показ* * (частично/часть) * @TVChannelPlural } *
        | * { не показ* * несколько * @TVChannelPlural } *
        | * { не показ* * некотор* * @TVChannelPlural } *
        | * { не работ* * (частично/часть) * @TVChannelPlural } *
        | * { не работ* * несколько * @TVChannelPlural } *
        | * { не работ* * некотор* * @TVChannelPlural } *
        | * { не подключ* * (частично/часть) * @TVChannelPlural } *
        | * { не подключ* * несколько * @TVChannelPlural } *
        | * { не подключ* * некотор* * @TVChannelPlural } *  )